/* 
1. 지도 생성 & 확대 축소 컨트롤러
2. 더미데이터 준비하기 (제목, 주소, url, 카테고리)
3. 여러개 마커 찍기
  * 주소 - 좌표 변환 (지도 라이브러리)
4. 마커에 인포윈도우 붙이기
  * 마커에 클릭 이벤트로 인포윈도우
  * url에서 섬네일 따기
  * 클릭한 마커로 지도 센터 이동
5. 카테고리 분류
*/

/*
**********************************************************
1. 지도 생성 & 확대 축소 컨트롤러
https://apis.map.kakao.com/web/sample/addMapControl/
*/
var radius = 100000;
var container = document.getElementById("map"); //지도를 담을 영역의 DOM 레퍼런스
var options = {
  //지도를 생성할 때 필요한 기본 옵션
  center: new kakao.maps.LatLng(37.65835990000001,126.8320201), //지도의 중심좌표. 서울 한가운데
  level: 8, //지도의 레벨(확대, 축소 정도) 3에서 8레벨로 확대
};

var map = new kakao.maps.Map(container, options); //지도 생성 및 객체 리턴

// 지도 확대 축소를 제어할 수 있는  줌 컨트롤을 생성합니다
var zoomControl = new kakao.maps.ZoomControl();
map.addControl(zoomControl, kakao.maps.ControlPosition.RIGHT);
//현재 위치의 마커 뿌리기
var markerPosition  = new kakao.maps.LatLng(37.65835990000001,126.8320201); 
var imageSrc = "https://t1.daumcdn.net/localimg/localimages/07/mapapidoc/markerStar.png"; 
  // 마커 이미지의 이미지 크기 입니다
    var imageSize = new kakao.maps.Size(24, 35); 
    
    // 마커 이미지를 생성합니다    
    var markerImage = new kakao.maps.MarkerImage(imageSrc, imageSize); 
// 마커를 생성합니다
var markerHere = new kakao.maps.Marker({
    map: map,
    position: markerPosition,
    image : markerImage 
});
/*
**********************************************************
2. 더미데이터 준비하기 (제목, 주소, url, 카테고리)
*/

const dataSet =[
 {
  "title": "GS25 관산수향점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 626-1",
  "phone": "031-965-0590",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71364041,
  "long": 126.865363
 },
 {
  "title": "CU 관산고골마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 669-4",
  "phone": "031-969-0992",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71095042,
  "long": 126.8579706
 },
 {
  "title": "이마트24 고양관산점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 672-4",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7091248,
  "long": 126.8553158
 },
 {
  "title": "세븐일레븐 주교스타점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 605-18",
  "phone": "031-965-9069",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6565362,
  "long": 126.8308173
 },
 {
  "title": "CU 원당대로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 609-9, 은백양빌딩",
  "phone": "031-965-7715",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65550887,
  "long": 126.8338815
 },
 {
  "title": "CU 원당중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 704",
  "phone": "031-969-5307",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6547518,
  "long": 126.8380665
 },
 {
  "title": "GS25 삼송동산점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 178, 105호",
  "phone": "02-357-1914",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64414481,
  "long": 126.8921129
 },
 {
  "title": "이마트24 스타필드고양1호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 370, 스타필드 고양",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64697631,
  "long": 126.8947784
 },
 {
  "title": "이마트24 스타필드고양2호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 370, 스타필드 고양",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64697631,
  "long": 126.8947784
 },
 {
  "title": "이마트24 스타필드고양3호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 370, 스타필드 고양",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64697631,
  "long": 126.8947784
 },
 {
  "title": "이마트24 스타필드고양4호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 370, 스타필드 고양",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64697631,
  "long": 126.8947784
 },
 {
  "title": "이마트24 스타필드고양5호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 370, 스타필드 고양",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64697631,
  "long": 126.8947784
 },
 {
  "title": "이마트24 스타필드고양6호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 370, 스타필드 고양",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64697631,
  "long": 126.8947784
 },
 {
  "title": "파리바게트원당어울림",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 722-4",
  "phone": "031-975-9834",
  "open": null,
  "close": null,
  "lat": 37.65332641,
  "long": 126.8375635
 },
 {
  "title": "이마트24 고양새롬점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 722-6, 새롬프라자",
  "phone": "031-966-7373",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65322253,
  "long": 126.8380196
 },
 {
  "title": "CU 고양신원당점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 723, 어울림마을2단지아파트 상가동 104호",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65241854,
  "long": 126.8378069
 },
 {
  "title": "맘스터치 원당어울림점",
  "category": "패스트푸드",
  "address": "경기도 고양시 덕양구 성사동 720-2",
  "phone": "031-967-8982",
  "open": null,
  "close": null,
  "lat": 37.6538062,
  "long": 126.8379127
 },
 {
  "title": "GS25 덕양성사점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 722-3, 신원당프라자 1층 6호, 7호",
  "phone": "031-968-8650",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6535055,
  "long": 126.8376825
 },
 {
  "title": "이마트24 성사타운점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 494-28",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65753561,
  "long": 126.8400592
 },
 {
  "title": "세븐일레븐 고양롯데아울렛점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1003, 이케아 고양점 지하1층",
  "phone": "031-8035-2735",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62958727,
  "long": 126.8631237
 },
 {
  "title": "CU 원흥봄오피스텔점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 627",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6498645,
  "long": 126.8741734
 },
 {
  "title": "신김밥천국",
  "category": "분식",
  "address": "경기도 고양시 덕양구 신원동 621-3, 태웅PLAZA 104호",
  "phone": "02-381-7422",
  "open": null,
  "close": null,
  "lat": 37.66327526,
  "long": 126.889084
 },
 {
  "title": "CU 삼송호평점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 626, 호평PLAZA, 107호",
  "phone": "02-381-0686",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66274593,
  "long": 126.8895563
 },
 {
  "title": "롯데리아 삼송신원점",
  "category": "패스트푸드",
  "address": "경기도 고양시 덕양구 신원동 627",
  "phone": "02-381-2355",
  "open": null,
  "close": null,
  "lat": 37.66297692,
  "long": 126.8899186
 },
 {
  "title": "이마트24 삼송파스텔시티점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 620-1, 파스텔 시티",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66368326,
  "long": 126.8898391
 },
 {
  "title": "CU 내유희망점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 239-3",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72141493,
  "long": 126.8569697
 },
 {
  "title": "착한피자",
  "category": "양식",
  "address": "경기도 고양시 덕양구 토당동 347-7, 1층 104호",
  "phone": "031-971-2522",
  "open": null,
  "close": null,
  "lat": 37.62165158,
  "long": 126.8202892
 },
 {
  "title": "이마트24 능곡홈타운점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 352, 능곡현대홈타운1차 상가",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6221085,
  "long": 126.8222682
 },
 {
  "title": "CU 능곡현대점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 344-73, 4호",
  "phone": "031-978-7411",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62241571,
  "long": 126.8203374
 },
 {
  "title": "CU 대곡역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 대장동 292-5, 근린상가",
  "phone": "031-967-6887",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6362099,
  "long": 126.8155817
 },
 {
  "title": "GS25 삼송18단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 332, 삼송마을18단지 상가동 109호",
  "phone": "02-371-3799",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64815627,
  "long": 126.8811474
 },
 {
  "title": "CU 삼송상록점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 337, 103호",
  "phone": "02-381-0248",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64815512,
  "long": 126.8836131
 },
 {
  "title": "CU 고양덕은점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 덕은동 201-4",
  "phone": "02-3159-8382",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.5868181,
  "long": 126.8761569
 },
 {
  "title": "세븐일레븐 원흥호반점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1001, 1층 104호",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62944169,
  "long": 126.8650181
 },
 {
  "title": "신김밥천국",
  "category": "분식",
  "address": "경기도 고양시 덕양구 도내동 1091, 태종빌딩 1층 102호",
  "phone": "031-966-1478",
  "open": null,
  "close": null,
  "lat": 37.62865345,
  "long": 126.869125
 },
 {
  "title": "GS25 원흥스위트점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1107, 고양 원흥 동일스위트 상가",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62670198,
  "long": 126.8708549
 },
 {
  "title": "GS25 덕양원흥점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1030-8",
  "phone": "031-964-7703",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63043648,
  "long": 126.8715643
 },
 {
  "title": "도래울찬방",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 도내동 1034-1, 1동 1층",
  "phone": "031-966-8222",
  "open": null,
  "close": null,
  "lat": 37.63031112,
  "long": 126.872285
 },
 {
  "title": "CU 원흥도래울점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1034-5",
  "phone": "070-8866-2512",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63018931,
  "long": 126.8729559
 },
 {
  "title": "세븐일레븐 원흥도내점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1011, 엘에이치원흥도래울마을4단지 상가",
  "phone": "031-965-9408",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63062231,
  "long": 126.8734491
 },
 {
  "title": "산동",
  "category": "중식",
  "address": "경기도 고양시 덕양구 도내동 1024, 105호",
  "phone": "031-974-5584",
  "open": null,
  "close": null,
  "lat": 37.63067641,
  "long": 126.8701637
 },
 {
  "title": "파리바게트 원흥대영점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 도내동 958, 대영프라자 109호",
  "phone": "031-968-8204",
  "open": null,
  "close": null,
  "lat": 37.6348654,
  "long": 126.8712757
 },
 {
  "title": "파리바게뜨고양원흥점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 도내동 1087, 예승골드프라자 1층",
  "phone": "031-967-8249",
  "open": null,
  "close": null,
  "lat": 37.62937388,
  "long": 126.868802
 },
 {
  "title": "이마트24 도내원프라자점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1085, 103호, 107호",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62865404,
  "long": 126.8696597
 },
 {
  "title": "미복 도래울점",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 도내동 1022",
  "phone": "031-968-5672",
  "open": null,
  "close": null,
  "lat": 37.63068298,
  "long": 126.8695927
 },
 {
  "title": "GS25 원흥2단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 983, 엘에이치원흥도래울마을2단지 상가 2동 103호",
  "phone": "031-966-5250",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63430607,
  "long": 126.8706151
 },
 {
  "title": "세븐일레븐 고양원흥3단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1010, 엘에이치원흥도래울마을3단지 상가동 111호",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63105948,
  "long": 126.8711282
 },
 {
  "title": "GS25 삼송드림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 354, 1층",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64405136,
  "long": 126.8847525
 },
 {
  "title": "CU 삼송현대프라자점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 352, 현대프라자",
  "phone": "02-381-6690",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64484919,
  "long": 126.8861609
 },
 {
  "title": "이마트24 동산마을21단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 344, 동산마을 호반베르디움 상가",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64610248,
  "long": 126.8852525
 },
 {
  "title": "세븐일레븐 삼송파크드림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 345-6, 1층",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64354216,
  "long": 126.8836883
 },
 {
  "title": "CU 고양동산점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 345",
  "phone": "02-381-4533",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64283163,
  "long": 126.8831319
 },
 {
  "title": "GS25 삼송리슈빌점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 670, 삼송마을 15단지 계룡리슈빌 상가 2동 101호",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65136112,
  "long": 126.8821032
 },
 {
  "title": "GS25 삼송중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 324-1",
  "phone": "02-371-1220",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65020949,
  "long": 126.8837413
 },
 {
  "title": "GS25 삼송시티점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 369, 이편한세상시티삼송 상가 1-030, 1-031호",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64906492,
  "long": 126.8969738
 },
 {
  "title": "CU 관산삼거리점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 538-22",
  "phone": "031-964-5785",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7050171,
  "long": 126.860115
 },
 {
  "title": "이마트24 중부대입구점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 대자동 620, 라동 1층",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71166374,
  "long": 126.8878234
 },
 {
  "title": "이마트24 고양중부대점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 대자동 613-1, 중부대학교 고양캠퍼스 세종관 3층",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71376917,
  "long": 126.8886187
 },
 {
  "title": "GS25 관산럭키점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 687-56",
  "phone": "031-964-2505",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70501834,
  "long": 126.8579093
 },
 {
  "title": "케익하우스,인",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 주교동 568",
  "phone": "031-964-2043",
  "open": null,
  "close": null,
  "lat": 37.6629078,
  "long": 126.8383497
 },
 {
  "title": "롯데리아원당점",
  "category": "패스트푸드",
  "address": "경기도 고양시 덕양구 성사동 696-2, 금강빌딩",
  "phone": "031-965-8003",
  "open": null,
  "close": null,
  "lat": 37.65649699,
  "long": 126.8369367
 },
 {
  "title": "행주치마반찬",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 성사동 499, 그린빌딩",
  "phone": "031-968-9077",
  "open": null,
  "close": null,
  "lat": 37.658411,
  "long": 126.8395542
 },
 {
  "title": "세븐일레븐 성사사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 497-1, 102호",
  "phone": "031-968-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65833971,
  "long": 126.8403653
 },
 {
  "title": "세븐일레븐 성사중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 488-27",
  "phone": "031-966-7650",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6573319,
  "long": 126.841688
 },
 {
  "title": "GS25고양주교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 568, 1층 3호",
  "phone": "031-968-6322",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6629078,
  "long": 126.8383497
 },
 {
  "title": "이마트24 고양주교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 610-8",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6561348,
  "long": 126.8339503
 },
 {
  "title": "CU 원당장미점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 616-1",
  "phone": "031-968-2837",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6577423,
  "long": 126.8362462
 },
 {
  "title": "CU 박재궁점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 309-5, 101호",
  "phone": "031-963-8466",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6627162,
  "long": 126.8313539
 },
 {
  "title": "하늘채",
  "category": "중식",
  "address": "경기도 고양시 덕양구 행신동 712, 골드프라자",
  "phone": "031-970-2577",
  "open": null,
  "close": null,
  "lat": 37.6148382,
  "long": 126.8326428
 },
 {
  "title": "세븐일레븐 행신최고점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 712, 골드프라자 1층 104호",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6148382,
  "long": 126.8326428
 },
 {
  "title": "이마트24 덕양행신점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 709-1, 무원빌딩",
  "phone": "031-938-0360",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61343474,
  "long": 126.832636
 },
 {
  "title": "햇살찬누리",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 행신동 735-6",
  "phone": "031-938-9385",
  "open": null,
  "close": null,
  "lat": 37.6182536,
  "long": 126.8325124
 },
 {
  "title": "만리향",
  "category": "중식",
  "address": "경기도 고양시 덕양구 행신동 735-2",
  "phone": "031-970-6611",
  "open": null,
  "close": null,
  "lat": 37.6185005,
  "long": 126.8325176
 },
 {
  "title": "GS25 무원로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 736, 1층 일부",
  "phone": "031-978-2341",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6188265,
  "long": 126.8325012
 },
 {
  "title": "GS25 행신무원점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 720-12, 1층 일부",
  "phone": "031-971-3413",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61603303,
  "long": 126.8325093
 },
 {
  "title": "세븐일레븐 행신중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 725,",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61702552,
  "long": 126.8335131
 },
 {
  "title": "CU 덕양무원초교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 720",
  "phone": "031-979-3595",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61673221,
  "long": 126.8325312
 },
 {
  "title": "GS25 행신단비점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 707, 남정씨티프라자6차 1층 104호",
  "phone": "031-970-0019",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6140026,
  "long": 126.8337177
 },
 {
  "title": "CU 행신리치빌점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 713-1, 지엘리치빌 2차 104호",
  "phone": "031-972-6290",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6147407,
  "long": 126.8331688
 },
 {
  "title": "CU 화정은빛11단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 961, 은빛마을11단지아파트 상가",
  "phone": "031-967-9270",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63668391,
  "long": 126.8353033
 },
 {
  "title": "세븐일레븐 고양화정동점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 879",
  "phone": "031-965-1205",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6389193,
  "long": 126.8353366
 },
 {
  "title": "세븐일레븐 덕양옥빛15단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1129, 옥빛마을15단지 상가동 101호",
  "phone": "031-979-1642",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62865169,
  "long": 126.8334178
 },
 {
  "title": "파리바게뜨",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1000-3, 네이버타운 101, 102호",
  "phone": "031-970-8208",
  "open": null,
  "close": null,
  "lat": 37.63030565,
  "long": 126.8332319
 },
 {
  "title": "GS25 화정옥빛점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1139, 옥빛마을 17단지 상가 104호",
  "phone": "031-972-8983",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6261207,
  "long": 126.8326363
 },
 {
  "title": "CU 화정센트리움점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 986-6, 동도센트리움 1층 101호",
  "phone": "031-973-7355",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63150591,
  "long": 126.8333344
 },
 {
  "title": "CU 화정트레벨점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 975-3, 동양트레벨Ⅱ 104호",
  "phone": "031-978-8969",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6334522,
  "long": 126.8337203
 },
 {
  "title": "GS25 벽제점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 벽제동 565-14",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72963046,
  "long": 126.9104476
 },
 {
  "title": "CU 고양벽제플러스점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 1016",
  "phone": "031-965-5810",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71831879,
  "long": 126.9025354
 },
 {
  "title": "세븐일레븐 원흥반도스퀘어점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 629-1, 111호",
  "phone": "031-967-7110",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64961727,
  "long": 126.8755291
 },
 {
  "title": "이마트24 원흥유스퀘어점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 629-1, 124호",
  "phone": "031-969-9396",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64961727,
  "long": 126.8755291
 },
 {
  "title": "CU 고양삼송로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 30-35",
  "phone": "02-371-0616",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6529262,
  "long": 126.8928604
 },
 {
  "title": "한스부대찌개",
  "category": "한식",
  "address": "경기도 고양시 덕양구 삼송동 30-42",
  "phone": "02-381-9005",
  "open": null,
  "close": null,
  "lat": 37.65307651,
  "long": 126.8933782
 },
 {
  "title": "파리바게트 삼송역점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 삼송동 27-32, 1층 일부",
  "phone": "02-381-0005",
  "open": null,
  "close": null,
  "lat": 37.65375487,
  "long": 126.8942761
 },
 {
  "title": "GS25 삼송점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 27-1, 104호",
  "phone": "02-381-6867",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6538742,
  "long": 126.8947415
 },
 {
  "title": "GS25 원흥역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 629, 109호",
  "phone": "031-965-8601",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64978967,
  "long": 126.8749668
 },
 {
  "title": "GS25 덕양세솔점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 60-4, 1층",
  "phone": "02-381-4454",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65398375,
  "long": 126.8963641
 },
 {
  "title": "CU 삼송중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 360-1",
  "phone": "02-381-6602",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64359555,
  "long": 126.8759606
 },
 {
  "title": "이마트24 고양원흥점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 367-2",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6423917,
  "long": 126.8758312
 },
 {
  "title": "GS25 덕양삼송점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 355, 101호",
  "phone": "02-381-7939",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64472885,
  "long": 126.8775541
 },
 {
  "title": "CU 원흥사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 735-1, 일부호",
  "phone": "031-967-1179",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63625178,
  "long": 126.8735529
 },
 {
  "title": "GS25 삼송타운점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 655-5, 102, 103호",
  "phone": "031-966-9571",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65266519,
  "long": 126.8780125
 },
 {
  "title": "CU 원흥중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 658-2",
  "phone": "031-969-5273",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65413447,
  "long": 126.8769313
 },
 {
  "title": "CU 용두로드점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 용두동 432-297",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6279154,
  "long": 126.8906192
 },
 {
  "title": "GS25 덕양용두점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 용두동 436-6, 가동 코너",
  "phone": "02-352-1326",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63034326,
  "long": 126.8823815
 },
 {
  "title": "서정김밥",
  "category": "분식",
  "address": "경기도 고양시 덕양구 행신동 1081, 1층 101호",
  "phone": "031-966-6781",
  "open": null,
  "close": null,
  "lat": 37.61915288,
  "long": 126.8448702
 },
 {
  "title": "GS25 서정마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 1080-1, 정우빌딩 103호",
  "phone": "031-970-7754",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6186544,
  "long": 126.845776
 },
 {
  "title": "피자스쿨 행신서정점",
  "category": "양식",
  "address": "경기도 고양시 덕양구 행신동 1080-5, 미라클프라자 105호",
  "phone": "031-979-5589",
  "open": null,
  "close": null,
  "lat": 37.618765,
  "long": 126.8454719
 },
 {
  "title": "국수나무",
  "category": "분식",
  "address": "경기도 고양시 덕양구 행신동 1080-5, 101호",
  "phone": "031-978-7050",
  "open": null,
  "close": null,
  "lat": 37.6187933,
  "long": 126.8454871
 },
 {
  "title": "이마트24 행신서정마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 1062-2",
  "phone": "031-972-1382",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62102562,
  "long": 126.8466055
 },
 {
  "title": "서호냉면",
  "category": "한식",
  "address": "경기도 고양시 덕양구 행신동 1059-7",
  "phone": "031-970-0801",
  "open": null,
  "close": null,
  "lat": 37.62136879,
  "long": 126.8461922
 },
 {
  "title": "CU 행신복지관점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 1056-5",
  "phone": "031-973-3582",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62183538,
  "long": 126.8457366
 },
 {
  "title": "GS25 덕양행신점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 1061",
  "phone": "031-979-6372",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6211505,
  "long": 126.8455245
 },
 {
  "title": "CU 서정4단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 1068 ,서정마을4단지 상가동",
  "phone": "031-974-7803",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62008609,
  "long": 126.8502871
 },
 {
  "title": "효성각",
  "category": "중식",
  "address": "경기도 고양시 덕양구 화정동 1147, 글로벌테마프라자 106호",
  "phone": "031-978-5233",
  "open": null,
  "close": null,
  "lat": 37.62763378,
  "long": 126.8297472
 },
 {
  "title": "CU 화정옥빛점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1145-2, 선우빌딩 1층 106호",
  "phone": "031-970-8616",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62721377,
  "long": 126.8309243
 },
 {
  "title": "GS25 삼송로얄점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 302-1, 1층 일부",
  "phone": "02-381-2936",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65325498,
  "long": 126.8876394
 },
 {
  "title": "CU 삼송로얄점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 301-1",
  "phone": "02-371-0217",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65371596,
  "long": 126.8872987
 },
 {
  "title": "GS25 삼송스타점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 365, 동산마을 22단지 호반베르디움 상가 103, 104호",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64632936,
  "long": 126.8888418
 },
 {
  "title": "GS25 삼송아이파크점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 313-7, 103호",
  "phone": "02-381-1005",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65085245,
  "long": 126.8890073
 },
 {
  "title": "이마트24 행신소만점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 788, 소만마을5단지 상가동",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61418655,
  "long": 126.8420852
 },
 {
  "title": "CU 행신소만6단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 787, 소만마을6단지 상가동 105~108호",
  "phone": "031-970-0290",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61425771,
  "long": 126.8414009
 },
 {
  "title": "CU 원흥타운점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 640-2",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65182485,
  "long": 126.8739979
 },
 {
  "title": "CU 삼송동일2차점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 661, 삼송 동일스위트2차 상가동",
  "phone": "02-371-3294",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65949292,
  "long": 126.887163
 },
 {
  "title": "CU 삼송신원7단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 595, 신원마을7단지 삼송 동일스위트1차 상가동 106호",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6659529,
  "long": 126.8852355
 },
 {
  "title": "브레드코코아미",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 신원동 621, 삼정시티프라자 1층",
  "phone": "02-381-0415",
  "open": null,
  "close": null,
  "lat": 37.66397748,
  "long": 126.8885027
 },
 {
  "title": "GS25 북삼송점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 621, 삼송시티프라자 104호",
  "phone": "02-371-1560",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66397748,
  "long": 126.8885027
 },
 {
  "title": "GS25 삼송사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 616, 신원마을4단지 상가동 102-1,2,103호",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66458987,
  "long": 126.8882071
 },
 {
  "title": "GS25 삼송신원점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 649-1, 1층",
  "phone": "02-371-1189",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66156385,
  "long": 126.8895671
 },
 {
  "title": "CU 고양신원점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 650",
  "phone": "02-371-0686",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66124254,
  "long": 126.8889647
 },
 {
  "title": "세븐일레븐 화정달빛마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 858, 달빛마을1단지 상가동 107, 108호",
  "phone": "02-3284-8187",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64811489,
  "long": 126.8322503
 },
 {
  "title": "CU 고양어울림누리점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 826, 고양어울림누리 수영장체육관 B1층",
  "phone": "031-967-1580",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6490563,
  "long": 126.8353666
 },
 {
  "title": "CU 삼송신원2단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 611, 신원마을엘에이치2단지 상가동",
  "phone": "02-371-3337",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66491065,
  "long": 126.8921146
 },
 {
  "title": "세븐일레븐 행신쌍용점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 767, 무원마을5단지 상가동 107호",
  "phone": "031-972-5066",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61396262,
  "long": 126.8364362
 },
 {
  "title": "파리바게트",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 행신동 752-2, 행신프라자",
  "phone": "031-973-7776",
  "open": null,
  "close": null,
  "lat": 37.61522647,
  "long": 126.8356107
 },
 {
  "title": "후룡",
  "category": "중식",
  "address": "경기도 고양시 덕양구 행신동 743-11",
  "phone": "031-973-8856",
  "open": null,
  "close": null,
  "lat": 37.61783935,
  "long": 126.835613
 },
 {
  "title": "GS25 덕양용현로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 743-1",
  "phone": "031-972-1660",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61844119,
  "long": 126.8356149
 },
 {
  "title": "세븐일레븐 행신역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 763-3, 백산오피스텔 108호",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61353174,
  "long": 126.8349835
 },
 {
  "title": "미각",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 주교동 26-9",
  "phone": "031-966-5939",
  "open": null,
  "close": null,
  "lat": 37.6623718,
  "long": 126.8391797
 },
 {
  "title": "세븐일레븐 덕양마상로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 578-7",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65991131,
  "long": 126.8353517
 },
 {
  "title": "세븐일레븐 고양원당로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 569-1",
  "phone": "031-965-4920",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66191492,
  "long": 126.8378332
 },
 {
  "title": "GS25 고양점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 602-9, 1층",
  "phone": "031-968-1419",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6568315,
  "long": 126.831521
 },
 {
  "title": "중화요리 여의주",
  "category": "중식",
  "address": "경기도 고양시 덕양구 주교동 599-7",
  "phone": "031-967-2008",
  "open": null,
  "close": null,
  "lat": 37.6579249,
  "long": 126.8337501
 },
 {
  "title": "CU 주교제일점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 599",
  "phone": "031-969-5313",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65829817,
  "long": 126.8337959
 },
 {
  "title": "이마트24 대학생연합생활관점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 616",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6507109,
  "long": 126.8671146
 },
 {
  "title": "GS25 삼송행복점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 615, 고양삼송엘에이치원흥마을11단지 상가 103, 104호",
  "phone": "031-964-8600",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65088616,
  "long": 126.8659448
 },
 {
  "title": "이마트24 원흥타운점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 620",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65126874,
  "long": 126.869661
 },
 {
  "title": "GS25 원흥푸르지오점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 원흥동 630, 상가113호",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64861645,
  "long": 126.8765461
 },
 {
  "title": "세븐일레븐 고양삼송점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 345-1",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64721396,
  "long": 126.8760181
 },
 {
  "title": "세븐일레븐 고양삼송점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 삼송동 345-1",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64721396,
  "long": 126.8760181
 },
 {
  "title": "GS25 고양내유점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 646-11",
  "phone": "031-964-6353",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72616114,
  "long": 126.8454776
 },
 {
  "title": "파리바게트내유점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 646-23",
  "phone": "031-969-8283",
  "open": null,
  "close": null,
  "lat": 37.72531209,
  "long": 126.8438421
 },
 {
  "title": "한국유통내유점",
  "category": "마트",
  "address": "경기도 고양시 덕양구 내유동 648-8",
  "phone": "031-963-1800",
  "open": null,
  "close": null,
  "lat": 37.72639419,
  "long": 126.8473238
 },
 {
  "title": "CU 내유무지개점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 625",
  "phone": "031-963-2115",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72679897,
  "long": 126.848292
 },
 {
  "title": "세븐일레븐 내유최고점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 667-8",
  "phone": "031-964-6823",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72804948,
  "long": 126.845455
 },
 {
  "title": "세븐일레븐 화정사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 923-19",
  "phone": "031-967-8293",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6390361,
  "long": 126.8300254
 },
 {
  "title": "GS25화정보람점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 917-8",
  "phone": "031-968-8573",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6397309,
  "long": 126.8303046
 },
 {
  "title": "GS25 화정미래점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 930",
  "phone": "031-963-8573",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63852151,
  "long": 126.8299186
 },
 {
  "title": "CU 화정도서관점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 878-7",
  "phone": "031-968-9826",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6382516,
  "long": 126.8364336
 },
 {
  "title": "세븐일레븐 고양일고점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 248-74, 프라자리치 107, 108호",
  "phone": "031-962-6912",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7004202,
  "long": 126.9012093
 },
 {
  "title": "CU 고양우리점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 373",
  "phone": "031-967-1201",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70512496,
  "long": 126.8982826
 },
 {
  "title": "CU 고양스위트점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 도내동 1122, 1층",
  "phone": "031-968-8264",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62492737,
  "long": 126.8727881
 },
 {
  "title": "GS25 상암서림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 덕은동 425-28",
  "phone": "02-3158-5188",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.57920372,
  "long": 126.859865
 },
 {
  "title": "CU 화전양지마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화전동 231-8",
  "phone": "02-3159-0290",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.599561,
  "long": 126.8749019
 },
 {
  "title": "CU 항공대2호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화전동 575-6, 1층",
  "phone": "02-3159-1440",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6028165,
  "long": 126.8696368
 },
 {
  "title": "GS25 화전역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화전동 578-1, 1층",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6035183,
  "long": 126.8693349
 },
 {
  "title": "뚜레쥬르행신서정마을점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 행신동 1083-3, 아름터프라자 101호",
  "phone": "031-973-0435",
  "open": null,
  "close": null,
  "lat": 37.61800204,
  "long": 126.8467122
 },
 {
  "title": "한솥도시락행신서정점",
  "category": "분식",
  "address": "경기도 고양시 덕양구 행신동 1083-3, 아름터프라자 104호",
  "phone": "031-938-9994",
  "open": null,
  "close": null,
  "lat": 37.61800204,
  "long": 126.8467122
 },
 {
  "title": "파리바게트행신서정점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 행신동 1083, 아성프라자 106호",
  "phone": "031-971-8208",
  "open": null,
  "close": null,
  "lat": 37.61822106,
  "long": 126.8460779
 },
 {
  "title": "김밥천국",
  "category": "분식",
  "address": "경기도 고양시 덕양구 행신동 1082-2, 명성프라자 104호",
  "phone": "031-979-6333",
  "open": null,
  "close": null,
  "lat": 37.61844019,
  "long": 126.845533
 },
 {
  "title": "피자마루 일산행신서정마을점",
  "category": "양식",
  "address": "경기도 고양시 덕양구 행신동 1082-2, 명성프라자 109호",
  "phone": "031-930-7430",
  "open": null,
  "close": null,
  "lat": 37.61844019,
  "long": 126.845533
 },
 {
  "title": "GS25 행신가라뫼점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 195-1, 행신미원프라자 1층",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6194103,
  "long": 126.8426459
 },
 {
  "title": "사오정떡볶이",
  "category": "분식",
  "address": "경기도 고양시 덕양구 행신동 952, 세신훼미리타운 110호",
  "phone": "031-815-2608",
  "open": null,
  "close": null,
  "lat": 37.6233083,
  "long": 126.8369804
 },
 {
  "title": "장독대 행신PM점",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 행신동 945-3, 행신동비전프라자 104호",
  "phone": "031-978-5688",
  "open": null,
  "close": null,
  "lat": 37.62424002,
  "long": 126.8356751
 },
 {
  "title": "먹어볼래짜장",
  "category": "중식",
  "address": "경기도 고양시 덕양구 행신동 999-1, 그랑프리빌딩 104호",
  "phone": "031-970-5162",
  "open": null,
  "close": null,
  "lat": 37.62353959,
  "long": 126.8347379
 },
 {
  "title": "GS25 행신그랑프리점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 999-1, 그랑프리빌딩 107호",
  "phone": "031-970-0702",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62353959,
  "long": 126.8347379
 },
 {
  "title": "GS25 화정중앙로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1148-2,㈜케이엠엠 순화빌딩",
  "phone": "031-971-0344",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62740613,
  "long": 126.8293429
 },
 {
  "title": "세븐일레븐 고양경찰서점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1148-1, 예일프라자 1층",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62753522,
  "long": 126.8289117
 },
 {
  "title": "GS25 행신최고점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 948-2, 능곡종합프라자",
  "phone": "031-938-8884",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6236179,
  "long": 126.8366731
 },
 {
  "title": "CU 행신중앙로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 948, 신일빌딩",
  "phone": "031-970-7752",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6240208,
  "long": 126.836109
 },
 {
  "title": "CU 행신18단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 939, 햇빛마을18단지 상가동",
  "phone": "031-970-9690",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6257025,
  "long": 126.8372716
 },
 {
  "title": "한솥도시락",
  "category": "분식",
  "address": "경기도 고양시 덕양구 행신동 945-3, 행신동비전프라자 104호",
  "phone": "031-970-8825",
  "open": null,
  "close": null,
  "lat": 37.62424002,
  "long": 126.8356615
 },
 {
  "title": "GS25 행신비전점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 945-3, 행신동비전프라자 105호",
  "phone": "031-979-4288",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62424002,
  "long": 126.8356615
 },
 {
  "title": "CU 행신SK점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 634-73",
  "phone": "031-973-6690",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62220274,
  "long": 126.8323516
 },
 {
  "title": "세븐일레븐 고양덕은점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 덕은동 15-18",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.59581996,
  "long": 126.8778171
 },
 {
  "title": "이마트24 덕양지도공원점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 899-9",
  "phone": "031-970-1582",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62713351,
  "long": 126.8277431
 },
 {
  "title": "한솥도시락능곡병원앞점",
  "category": "분식",
  "address": "경기도 고양시 덕양구 토당동 845, 파워프라자 106호",
  "phone": "031-938-1180",
  "open": null,
  "close": null,
  "lat": 37.6260499,
  "long": 126.824055
 },
 {
  "title": "GS25 능곡파워점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 845, 파워프라자",
  "phone": "031-970-2471",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6260499,
  "long": 126.824055
 },
 {
  "title": "파리바게트능곡점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 토당동 840-3, 1층 A호",
  "phone": "031-972-8210",
  "open": null,
  "close": null,
  "lat": 37.6264748,
  "long": 126.8234313
 },
 {
  "title": "세븐일레븐 능곡사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 842-6, 현대빌딩",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6278488,
  "long": 126.8234704
 },
 {
  "title": "뚜레쥬르고양능곡점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 토당동 864-3",
  "phone": "031-974-5005",
  "open": null,
  "close": null,
  "lat": 37.62041791,
  "long": 126.8243291
 },
 {
  "title": "김밥천국(행주동소재)",
  "category": "분식",
  "address": "경기도 고양시 덕양구 토당동 865",
  "phone": "031-938-0446",
  "open": null,
  "close": null,
  "lat": 37.62024482,
  "long": 126.8242109
 },
 {
  "title": "CU 토당제일점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 897, 소정빌딩",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62743388,
  "long": 126.826133
 },
 {
  "title": "GS25 토당본점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 834-9, 승혜빌딩",
  "phone": "031-938-0437",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6272165,
  "long": 126.8221346
 },
 {
  "title": "이마트24 용현하이젠점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 863-3, 용현하이젠 101,102호",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62026959,
  "long": 126.8239534
 },
 {
  "title": "세븐일레븐 고양토당미림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 871-5, 미림빌라 102호",
  "phone": "070-7729-2110",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62181072,
  "long": 126.8254512
 },
 {
  "title": "GS25 고양사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 848-15",
  "phone": "031-938-0748",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6255252,
  "long": 126.8249231
 },
 {
  "title": "CU 행신소만점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 799, 소만마을3단지 상가",
  "phone": "031-938-2940",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61574712,
  "long": 126.8448456
 },
 {
  "title": "GS25 행신중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 756-17",
  "phone": "031-972-7965",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6156247,
  "long": 126.8356355
 },
 {
  "title": "이마트24 행신소만2단지점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 798, 소만마을2단지 상가동",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61599679,
  "long": 126.8456062
 },
 {
  "title": "GS25 샘터충장로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 996-5, 원스톱라이프상",
  "phone": "031-972-7292",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6224536,
  "long": 126.8352122
 },
 {
  "title": "세븐일레븐 행신샘터점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 987, 부활교육센타",
  "phone": "031-978-7325",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6215378,
  "long": 126.8357948
 },
 {
  "title": "CU 행신역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 762, 1층 일부",
  "phone": "031-978-9703",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61403557,
  "long": 126.8344546
 },
 {
  "title": "GS25 행신센트럴점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 762-5, 114호",
  "phone": "070-4111-8688",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61313459,
  "long": 126.8344676
 },
 {
  "title": "세븐일레븐 고양토당로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 296-12, 서원빌딩",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6239456,
  "long": 126.8178781
 },
 {
  "title": "GS25 일산토당점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 282-23, 금호프라자 113,4호",
  "phone": "031-971-8006",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62541985,
  "long": 126.8169504
 },
 {
  "title": "세븐일레븐 토당대림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 259, 대림아파트 상가동 101~103호",
  "phone": "031-938-3720",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62590612,
  "long": 126.8168262
 },
 {
  "title": "CU 토당대림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 254-2, 형제빌딩 106, 107호",
  "phone": "031-970-0925",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62640447,
  "long": 126.8174651
 },
 {
  "title": "GS25 능곡역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 444-1, 105호",
  "phone": "031-978-4288",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62049518,
  "long": 126.8205874
 },
 {
  "title": "세븐일레븐 고양능곡역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 339-4",
  "phone": "031-971-7772",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6207235,
  "long": 126.8198526
 },
 {
  "title": "GS25 토당행복점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 298, 한라비발디아파트 상가동 101,102호",
  "phone": "031-938-7305",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62327253,
  "long": 126.8174035
 },
 {
  "title": "GS25 토당럭키점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 866, 동진빌딩",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61931142,
  "long": 126.8242604
 },
 {
  "title": "CU 토당풍림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 79-7, 인수빌딩 1층",
  "phone": "031-938-5170",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6267303,
  "long": 126.8209097
 },
 {
  "title": "GS25 토당금강점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 836-2, 1층 일부",
  "phone": "031-978-9930",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62771116,
  "long": 126.8211634
 },
 {
  "title": "GS25 능곡대림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 856-2, 세화빌딩 1층",
  "phone": "031-973-4288",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62039994,
  "long": 126.8219596
 },
 {
  "title": "세븐일레븐 고양통일로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 685-32",
  "phone": "031-962-3385",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70843581,
  "long": 126.8557223
 },
 {
  "title": "파리바게트(내유럭키점)",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 294-7",
  "phone": "031-963-1077",
  "open": null,
  "close": null,
  "lat": 37.70977025,
  "long": 126.8536316
 },
 {
  "title": "GS25 내유로드점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 966-31",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72482117,
  "long": 126.843252
 },
 {
  "title": "GS25 명봉산로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 783-5",
  "phone": "031-965-1919",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72914498,
  "long": 126.8399109
 },
 {
  "title": "CU 삼송테크노밸리B동점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 376, 삼송테크노밸리 B동 150호",
  "phone": "02-2219-3556",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64913061,
  "long": 126.9021681
 },
 {
  "title": "CU 삼송테크노밸리A동점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 동산동 376, 삼송테크노밸리",
  "phone": "02-2219-3555",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64913061,
  "long": 126.9021681
 },
 {
  "title": "CU 삼송우남점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 신원동 609, 신원마을 1단지 우남퍼스트빌 상가동 1층",
  "phone": "02-381-4731",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66911686,
  "long": 126.8887081
 },
 {
  "title": "GS25 덕양관산점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 178-29",
  "phone": "031-964-3604",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6875228,
  "long": 126.8669173
 },
 {
  "title": "CU 고양관산점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 1015, 더퍼스트프라임 178호",
  "phone": "031-969-9658",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68786252,
  "long": 126.8660823
 },
 {
  "title": "먹보왕만두",
  "category": "분식",
  "address": "경기도 고양시 덕양구 관산동 910-1",
  "phone": "031-962-8035",
  "open": null,
  "close": null,
  "lat": 37.68790835,
  "long": 126.8651669
 },
 {
  "title": "뚜레쥬르 고양관산점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 관산동 910-1",
  "phone": "031-963-0453",
  "open": null,
  "close": null,
  "lat": 37.68790835,
  "long": 126.8651669
 },
 {
  "title": "GS25 관산신성점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 210-7",
  "phone": "031-816-1122",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68640016,
  "long": 126.8652169
 },
 {
  "title": "파리바게트 고양관산점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 관산동 227-6",
  "phone": "031-962-8284",
  "open": null,
  "close": null,
  "lat": 37.6880891,
  "long": 126.8645216
 },
 {
  "title": "롯데리아고양관산점",
  "category": "패스트푸드",
  "address": "경기도 고양시 덕양구 관산동 231-29",
  "phone": "031-964-9339",
  "open": null,
  "close": null,
  "lat": 37.68873826,
  "long": 126.8629249
 },
 {
  "title": "CU 벽제통일로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 관산동 231-28",
  "phone": "031-963-4866",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68881014,
  "long": 126.8627448
 },
 {
  "title": "토스트굽는사람들",
  "category": "분식",
  "address": "경기도 고양시 덕양구 관산동 231-55",
  "phone": "031-963-2300",
  "open": null,
  "close": null,
  "lat": 37.68902923,
  "long": 126.862103
 },
 {
  "title": "GS25 고양통일로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 431-1",
  "phone": "031-967-9253",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71492141,
  "long": 126.8516091
 },
 {
  "title": "GS25 고양제일점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 427-1",
  "phone": "070-7765-1812",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71800807,
  "long": 126.8502264
 },
 {
  "title": "GS25 내유중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 내유동 471-19, 지층",
  "phone": "031-966-7863",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72081143,
  "long": 126.8498578
 },
 {
  "title": "엘리트피자",
  "category": "양식",
  "address": "경기도 고양시 덕양구 관산동 178-46",
  "phone": "031-964-3260",
  "open": null,
  "close": null,
  "lat": 37.68775531,
  "long": 126.8668852
 },
 {
  "title": "봉구스밥버거관산점",
  "category": "분식",
  "address": "경기도 고양시 덕양구 관산동 179-7",
  "phone": "031-818-1345",
  "open": null,
  "close": null,
  "lat": 37.6883264,
  "long": 126.8656007
 },
 {
  "title": "GS25 고양동익점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 719, 푸른마을3단지 상가 107호",
  "phone": "031-964-3164",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70992585,
  "long": 126.9031678
 },
 {
  "title": "롯데리아고양동점",
  "category": "패스트푸드",
  "address": "경기도 고양시 덕양구 고양동 682, 고양동 선 빌딩",
  "phone": "031-967-5335",
  "open": null,
  "close": null,
  "lat": 37.7103029,
  "long": 126.9051315
 },
 {
  "title": "CU 고양동푸른마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 734, 푸른마을4단지아파트 상가",
  "phone": "031-969-7001",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71190691,
  "long": 126.9062909
 },
 {
  "title": "CU 고양동익점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 721, 고양e-PLAZA",
  "phone": "031-963-3091",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70890572,
  "long": 126.9028879
 },
 {
  "title": "GS25 벽제풍림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 880, 1층 1호",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7160418,
  "long": 126.9022727
 },
 {
  "title": "GS25 항공대학생회관점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화전동 646-6",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.59901633,
  "long": 126.8641855
 },
 {
  "title": "CU 국제은익관점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화전동 646-6, 한국항공대학교",
  "phone": "02-3159-7479",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.59901633,
  "long": 126.8641855
 },
 {
  "title": "CU 고양토당점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 877-12, 신명빌딩 1층",
  "phone": "031-972-4583",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62020266,
  "long": 126.8249827
 },
 {
  "title": "세븐일레븐 고양토당본점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 토당동 878-8, 102호",
  "phone": "031-938-5765",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6198402,
  "long": 126.8261465
 },
 {
  "title": "설가네분식",
  "category": "분식",
  "address": "경기도 고양시 덕양구 토당동 881-5, 미성빌라트",
  "phone": "031-972-2154",
  "open": null,
  "close": null,
  "lat": 37.61960561,
  "long": 126.8282543
 },
 {
  "title": "CU 행신1호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 647-31",
  "phone": "031-974-2551",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6193011,
  "long": 126.8313757
 },
 {
  "title": "대성원",
  "category": "중식",
  "address": "경기도 고양시 덕양구 토당동 407-8",
  "phone": "031-970-5556",
  "open": null,
  "close": null,
  "lat": 37.6179084,
  "long": 126.8267045
 },
 {
  "title": "GS25 행신현대점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 644-44",
  "phone": "031-970-0250",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6239048,
  "long": 126.8295588
 },
 {
  "title": "GS25 행신뷰점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 617-17",
  "phone": "031-970-1125",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62000654,
  "long": 126.8313846
 },
 {
  "title": "이마트24 행신SK점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 620-2",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.62013788,
  "long": 126.832508
 },
 {
  "title": "GS25 행신로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 224-7",
  "phone": "031-938-8883",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6222169,
  "long": 126.8455072
 },
 {
  "title": "천지향",
  "category": "중식",
  "address": "경기도 고양시 덕양구 행신동 965-2",
  "phone": "031-970-8598",
  "open": null,
  "close": null,
  "lat": 37.6225062,
  "long": 126.8442031
 },
 {
  "title": "GS25 행신본점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 214-7, 1층",
  "phone": "031-978-5915",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6230314,
  "long": 126.8432037
 },
 {
  "title": "CU 행신3동점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 909-15",
  "phone": "031-792-9223",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6266091,
  "long": 126.8438087
 },
 {
  "title": "세븐일레븐 고양행주산성점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행주내동 186-6",
  "phone": "031-974-0088",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6049155,
  "long": 126.8247683013
 },
 {
  "title": "CU 행주대교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행주내동 439-9",
  "phone": "070-8839-2621",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.60880085,
  "long": 126.8209181
 },
 {
  "title": "정성가득찬 반찬나라",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 고양동 205, 1(일부)층",
  "phone": "031-967-9044",
  "open": null,
  "close": null,
  "lat": 37.70191341,
  "long": 126.9019543
 },
 {
  "title": "세븐일레븐 고양초교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 240-15",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7024529,
  "long": 126.9006783
 },
 {
  "title": "CU 벽제삼거리점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 937, 대성빌딩",
  "phone": "031-964-3827",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71661302,
  "long": 126.9011546
 },
 {
  "title": "봉구스밥버거고양동점",
  "category": "분식",
  "address": "경기도 고양시 덕양구 고양동 227",
  "phone": "031-964-0079",
  "open": null,
  "close": null,
  "lat": 37.7028092,
  "long": 126.9017301
 },
 {
  "title": "소문난매운떡볶이",
  "category": "분식",
  "address": "경기도 고양시 덕양구 고양동 233-15",
  "phone": "031-962-0590",
  "open": null,
  "close": null,
  "lat": 37.70344081,
  "long": 126.9012017
 },
 {
  "title": "CU 고양점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 126-1",
  "phone": "031-964-9306",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7039027,
  "long": 126.9019101
 },
 {
  "title": "김밥나라",
  "category": "분식",
  "address": "경기도 고양시 덕양구 고양동 35, 하나빌딩",
  "phone": "031-963-8825",
  "open": null,
  "close": null,
  "lat": 37.7057423,
  "long": 126.9021593
 },
 {
  "title": "세븐일레븐 고양점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 174-1, 여산빌딩",
  "phone": "031-962-0437",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7065647,
  "long": 126.9029104
 },
 {
  "title": "토스트굽는사람들",
  "category": "분식",
  "address": "경기도 고양시 덕양구 고양동 243, 삼라마이다스프라자 122호",
  "phone": "031-969-0021",
  "open": null,
  "close": null,
  "lat": 37.70107717,
  "long": 126.9018232
 },
 {
  "title": "CU 고양현대점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 고양동 240-8, 정호빌딩",
  "phone": "031-963-6216",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7015161,
  "long": 126.9015321
 },
 {
  "title": "파리바게트 고양점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 고양동 221",
  "phone": "031-964-1321",
  "open": null,
  "close": null,
  "lat": 37.70343045,
  "long": 126.9017384
 },
 {
  "title": "세븐일레븐 벽제점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 대자동 168-4",
  "phone": "031-964-8908",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68093703,
  "long": 126.8958459
 },
 {
  "title": "CU 고양호국로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 대자동 168-34",
  "phone": "031-963-2097",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68132323,
  "long": 126.8965956
 },
 {
  "title": "GS25 호국대로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 대자동 69-2",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6884123,
  "long": 126.9009928
 },
 {
  "title": "세븐일레븐 고양벽제본점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 벽제동 104",
  "phone": "031-964-5328",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71582756,
  "long": 126.9104441
 },
 {
  "title": "세븐일레븐 고양주교제일점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 609-3, 코스모프라자빌딩",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6556278,
  "long": 126.8348048
 },
 {
  "title": "미복 원당점",
  "category": "중식",
  "address": "경기도 고양시 덕양구 주교동 609-3",
  "phone": "031-962-6672",
  "open": null,
  "close": null,
  "lat": 37.65566872,
  "long": 126.8348035
 },
 {
  "title": "만리장성",
  "category": "중식",
  "address": "경기도 고양시 덕양구 주교동 614-4, 문화빌딩 1층 102호",
  "phone": "031-963-2631",
  "open": null,
  "close": null,
  "lat": 37.65640143,
  "long": 126.8356012
 },
 {
  "title": "세븐일레븐 덕양주교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 617-8, 동명빌딩 1층",
  "phone": "031-962-3564",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65781681,
  "long": 126.8349073
 },
 {
  "title": "레스쁘아제과점(성사점)",
  "category": "양식",
  "address": "경기도 고양시 덕양구 성사동 698, 연일빌딩",
  "phone": "031-963-6160",
  "open": null,
  "close": null,
  "lat": 37.6564281,
  "long": 126.836371
 },
 {
  "title": "뚜레쥬르고양성사점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 성사동 696-3",
  "phone": "031-967-0401",
  "open": null,
  "close": null,
  "lat": 37.6566263,
  "long": 126.8366237
 },
 {
  "title": "CU 성사중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 621-3",
  "phone": "031-967-5979",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6589081,
  "long": 126.8385151
 },
 {
  "title": "파리바게뜨고양성사점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 성사동 501-2, 명지캐럿86 115~116호",
  "phone": "031-965-7440",
  "open": null,
  "close": null,
  "lat": 37.65852863,
  "long": 126.8388544
 },
 {
  "title": "만나항아리",
  "category": "한식",
  "address": "경기도 고양시 덕양구 성사동 519-63",
  "phone": "031-966-6487",
  "open": null,
  "close": null,
  "lat": 37.66003709,
  "long": 126.840324
 },
 {
  "title": "GS25 원당대림점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 869, 대림e편한세상아파트 상가",
  "phone": "031-966-5263",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65956617,
  "long": 126.8385665
 },
 {
  "title": "GS25 고양원당점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 611, 대광빌딩 1층 2호",
  "phone": "031-962-1865",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.656836,
  "long": 126.8339802
 },
 {
  "title": "CU 덕양주교점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 주교동 613, 정하빌딩",
  "phone": "070-7621-7752",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6572348,
  "long": 126.8352206
 },
 {
  "title": "CU 원당역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 408-7",
  "phone": "031-966-9291",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65410352,
  "long": 126.8418839
 },
 {
  "title": "GS25 원당중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 367-7",
  "phone": "031-968-9950",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6558214,
  "long": 126.8378016
 },
 {
  "title": "세븐일레븐 원당역점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 702-8, 성지빌딩",
  "phone": "031-966-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6554425,
  "long": 126.8379654
 },
 {
  "title": "GS25 원당하늘점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 407-4, 선교빌딩 1층 코너",
  "phone": "031-964-3344",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6546088,
  "long": 126.8406571
 },
 {
  "title": "GS25 덕양휴레스트점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 860, 래미안휴레스트 상가동 103,4호",
  "phone": "031-967-1983",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65867029,
  "long": 126.8423356
 },
 {
  "title": "몰랑몰랑식빵",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 성사동 714",
  "phone": "031-963-1012",
  "open": null,
  "close": null,
  "lat": 37.66088799,
  "long": 126.8406127
 },
 {
  "title": "수림",
  "category": "중식",
  "address": "경기도 고양시 덕양구 화전동 380-9",
  "phone": "02-3159-3043",
  "open": null,
  "close": null,
  "lat": 37.6121221,
  "long": 126.8720634
 },
 {
  "title": "CU 항공대점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화전동 203-71",
  "phone": "02-3159-6153",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.60126173,
  "long": 126.8708671
 },
 {
  "title": "삼호정",
  "category": "중식",
  "address": "경기도 고양시 덕양구 화전동 576-20",
  "phone": "02-3158-3388",
  "open": null,
  "close": null,
  "lat": 37.6022284,
  "long": 126.870127
 },
 {
  "title": "햇빛반찬",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 행신동 956, 햇빛마을23단지 상가 102호",
  "phone": "031-979-5289",
  "open": null,
  "close": null,
  "lat": 37.6217202,
  "long": 126.840135
 },
 {
  "title": "김가네화정점",
  "category": "분식",
  "address": "경기도 고양시 덕양구 화정동 979-2, 백양빌딩 106호",
  "phone": "031-971-7774",
  "open": null,
  "close": null,
  "lat": 37.63213533,
  "long": 126.8324466
 },
 {
  "title": "세븐일레븐 화정4호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 1002-3, 이프라자",
  "phone": "031-971-5873",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63052312,
  "long": 126.8315428
 },
 {
  "title": "쉐프엠 화정1호점",
  "category": "중식",
  "address": "경기도 고양시 덕양구 화정동 1002-3, 이프라자 1층 110호",
  "phone": "031-973-5525",
  "open": null,
  "close": null,
  "lat": 37.63052312,
  "long": 126.8315428
 },
 {
  "title": "CU 화정별빛점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 952, 별빛마을8단지 상가 112~113호",
  "phone": "031-979-5874",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63133514,
  "long": 126.8298507
 },
 {
  "title": "뚜레쥬르무원점",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 행신동 771, 무원마을2단지 상가",
  "phone": "031-970-6199",
  "open": null,
  "close": null,
  "lat": 37.61570621,
  "long": 126.8385314
 },
 {
  "title": "GS25 화정별빛점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 948, 별빛마을9단지아파트 상가1층",
  "phone": "031-971-5999",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63133395,
  "long": 126.8265602
 },
 {
  "title": "파리바게트",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 행신동 981, 샘터마을2단지 상가 107, 108호",
  "phone": "031-938-8203",
  "open": null,
  "close": null,
  "lat": 37.6194273,
  "long": 126.838608
 },
 {
  "title": "GS25 행신샘터점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 981, 샘터마을2단지 상가동 101호",
  "phone": "031-970-7056",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6194273,
  "long": 126.838608
 },
 {
  "title": "이마트24 고양샘터점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 행신동 973, 샘터마을1단지 상가",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.61934359,
  "long": 126.8392561
 },
 {
  "title": "레스쁘아제과점(햇빛마을점)",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 행신동 956, 햇빛마을23단지 상가 108호",
  "phone": "031-938-6160",
  "open": null,
  "close": null,
  "lat": 37.6217202,
  "long": 126.840135
 },
 {
  "title": "CU 함께여는가게2호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 978-1, 첼시빌딩 101호",
  "phone": "031-938-2881",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6328138,
  "long": 126.8325826
 },
 {
  "title": "CU 화정요진타워점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 973, 요진타워 107호",
  "phone": "031-972-0824",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63362057,
  "long": 126.8327327
 },
 {
  "title": "세븐일레븐 고양화정터미널점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 974, 화정버스터미널",
  "phone": "031-2128-5850",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63418774,
  "long": 126.8337969
 },
 {
  "title": "세븐일레븐 화정수점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 984-9, 대경프라자 II 106호",
  "phone": "070-7554-0051",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6310217,
  "long": 126.8309464
 },
 {
  "title": "GS25 화정원빈점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 981, 원빈프라자 106호",
  "phone": "031-971-2562",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63312936,
  "long": 126.8319733
 },
 {
  "title": "주식회사 오옛떡",
  "category": "분식",
  "address": "경기도 고양시 덕양구 화정동 981, 원빈프라자 1층 105호",
  "phone": "031-938-0620",
  "open": null,
  "close": null,
  "lat": 37.63312936,
  "long": 126.8319894
 },
 {
  "title": "김밥천국",
  "category": "분식",
  "address": "경기도 고양시 덕양구 화정동 972, 영프라자빌딩 102호",
  "phone": "031-974-8288",
  "open": null,
  "close": null,
  "lat": 37.6336163,
  "long": 126.832106
 },
 {
  "title": "한솥도시락 화정별빛마을점",
  "category": "분식",
  "address": "경기도 고양시 덕양구 화정동 984-3, 세일빌딩 104호",
  "phone": "031-979-3288",
  "open": null,
  "close": null,
  "lat": 37.63115235,
  "long": 126.8305574
 },
 {
  "title": "CU 화정역2호점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 969, 동원텔",
  "phone": "031-812-7757",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6351555,
  "long": 126.8314092
 },
 {
  "title": "22세기반찬",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 화정동 969, 동원텔 103호",
  "phone": "070-4205-1605",
  "open": null,
  "close": null,
  "lat": 37.6351555,
  "long": 126.8314092
 },
 {
  "title": "파리바게트",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 화정동 969-1, 새롬프라자 105, 106호",
  "phone": "031-969-5393",
  "open": null,
  "close": null,
  "lat": 37.63522671,
  "long": 126.8318895
 },
 {
  "title": "GS25화정사랑점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 965, 한화오벨리스크 105-1호",
  "phone": "031-963-9696",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63499111,
  "long": 126.8334852
 },
 {
  "title": "세븐일레븐 화정꿈에그린점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 965-1, 한화꿈에그린아파트 108호",
  "phone": "031-969-7115",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6348369,
  "long": 126.8340203
 },
 {
  "title": "세븐일레븐 화정은빛마을점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 902, 고양프라자 101호",
  "phone": "031-962-0743",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63851731,
  "long": 126.8320261
 },
 {
  "title": "송화",
  "category": "한식",
  "address": "경기도 고양시 덕양구 화정동 903-1, 한마음프라자",
  "phone": "031-966-8877",
  "open": null,
  "close": null,
  "lat": 37.63840336,
  "long": 126.8330063
 },
 {
  "title": "행복반찬",
  "category": "반찬",
  "address": "경기도 고양시 덕양구 화정동 851, 달빛마을2단지 상가 110호",
  "phone": "031-965-0706",
  "open": null,
  "close": null,
  "lat": 37.64647137,
  "long": 126.8347106
 },
 {
  "title": "파리바게트",
  "category": "제과점",
  "address": "경기도 고양시 덕양구 화정동 851, 달빛마을2단지 상가 112, 113호",
  "phone": "031-966-6768",
  "open": null,
  "close": null,
  "lat": 37.64647137,
  "long": 126.8347106
 },
 {
  "title": "이마트24 화정달빛점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 851, 달빛마을2단지 상가 101호",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64647137,
  "long": 126.8347106
 },
 {
  "title": "CU 화정우정프라자점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 968-4, 우정프라자",
  "phone": "031-969-3420",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63573112,
  "long": 126.8317785
 },
 {
  "title": "GS25화정아카데미점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 968-2, 화정아카데미타워 105호",
  "phone": "031-968-5306",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.636026,
  "long": 126.8319522
 },
 {
  "title": "CU 덕양구청점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 967, 송화빌딩",
  "phone": "031-965-8799",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6360562,
  "long": 126.8325455
 },
 {
  "title": "봉구스밥버거",
  "category": "분식",
  "address": "경기도 고양시 덕양구 화정동 967, 송화빌딩 114호",
  "phone": "031-966-1515",
  "open": null,
  "close": null,
  "lat": 37.6360562,
  "long": 126.8325455
 },
 {
  "title": "GS25화정명품로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 966-1, 화정씨네마플러스 107호",
  "phone": "031-966-4656",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63572226,
  "long": 126.8331472
 },
 {
  "title": "CU 화정중앙점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 900-17",
  "phone": "031-965-0290",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6386183,
  "long": 126.8335104
 },
 {
  "title": "세븐일레븐 덕양화정점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 913",
  "phone": "031-966-7770",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6404248,
  "long": 126.8323207
 },
 {
  "title": "GS25 화정본점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 화정동 886-4",
  "phone": "031-966-6353",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6401394,
  "long": 126.8343477
 },
 {
  "title": "GS25 덕양흥도로점",
  "category": "편의점",
  "address": "경기도 고양시 덕양구 성사동 243-4, 나동 1층",
  "phone": "031-966-5307",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6450415,
  "long": 126.8516047
 },
 {
  "title": "GS25마두강촌점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 789, 강촌마을5단지아파트",
  "phone": "031-905-2409",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65122725,
  "long": 126.780833
 },
 {
  "title": "세븐일레븐 일산강촌마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 789, 강촌마을5단지아파트",
  "phone": "031-907-7115",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65122725,
  "long": 126.780833
 },
 {
  "title": "세븐일레븐 일산마두점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 800, 마두파킹프라자",
  "phone": "031-906-3461",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65321147,
  "long": 126.7780629
 },
 {
  "title": "뚜레쥬르(마두역점)",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 마두동 802, 뉴삼창마트",
  "phone": "031-932-1139",
  "open": null,
  "close": null,
  "lat": 37.65190096,
  "long": 126.7787711
 },
 {
  "title": "세븐일레븐 일산마두우방점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 794, 강촌마을8단지아파트",
  "phone": "031-904-7139",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65549968,
  "long": 126.782135
 },
 {
  "title": "씨유(CU) 일산강촌마을8단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 794",
  "phone": "031-904-5433",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65549968,
  "long": 126.782135
 },
 {
  "title": "씨유(CU) 일산벨라씨타1호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1237",
  "phone": "031-903-4561",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64406986,
  "long": 126.7928012
 },
 {
  "title": "씨유(CU) 일산벨라씨타2호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1237",
  "phone": "031-903-4562",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64406986,
  "long": 126.7928012
 },
 {
  "title": "한라산똥돼지",
  "category": "한식",
  "address": "경기도 고양시 일산동구 백석동 1228-3",
  "phone": "031-901-0304",
  "open": null,
  "close": null,
  "lat": 37.64880213,
  "long": 126.7869093
 },
 {
  "title": "씨유(CU) 일산백석빌리지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1227",
  "phone": "070-8879-8182",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.648817,
  "long": 126.7863691
 },
 {
  "title": "세븐일레븐 일산동구백석점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1202",
  "phone": "031-902-8656",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6485224,
  "long": 126.7837055
 },
 {
  "title": "큰아빠네 반찬",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 마두동 781-1, 현대프라자",
  "phone": "031-932-5577",
  "open": null,
  "close": null,
  "lat": 37.65391132,
  "long": 126.7842629
 },
 {
  "title": "GS25백석행운점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1252-7",
  "phone": "031-905-9357",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6471295,
  "long": 126.7883036
 },
 {
  "title": "씨유(CU) 일산백송마을5단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1190",
  "phone": "031-907-3298",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65156639,
  "long": 126.7869331
 },
 {
  "title": "이마트24 백송대우점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1135",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65432578,
  "long": 126.7943728
 },
 {
  "title": "씨유(CU) 일산백마점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 734",
  "phone": "031-906-6885",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65534272,
  "long": 126.7947372
 },
 {
  "title": "씨유(CU) 백석호수점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1452",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64630818,
  "long": 126.7790384
 },
 {
  "title": "만나분식",
  "category": "분식",
  "address": "경기도 고양시 일산동구 백석동 1424-7",
  "phone": "031-907-5095",
  "open": null,
  "close": null,
  "lat": 37.64428544,
  "long": 126.7824306
 },
 {
  "title": "GS25식사점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 184",
  "phone": "031-966-0730",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6836107,
  "long": 126.8210483
 },
 {
  "title": "이마트24 식사로드점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 196-1",
  "phone": "031-968-7199",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68450493,
  "long": 126.8208489
 },
 {
  "title": "이마트24 일산식사점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1152-3",
  "phone": "031-968-8510",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6881549,
  "long": 126.8195937
 },
 {
  "title": "세븐일레븐 일산문봉점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 문봉동 105-6",
  "phone": "031-977-7300",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69790353,
  "long": 126.8203956
 },
 {
  "title": "GS25백석동문점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1319, 동문굿모닝힐II",
  "phone": "031-906-6331",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63925391,
  "long": 126.7881883
 },
 {
  "title": "이마트24 일산백마점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 744",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.658011,
  "long": 126.7931338
 },
 {
  "title": "씨유(CU) 백마5단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 717",
  "phone": "031-932-2671",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65947738,
  "long": 126.7917393
 },
 {
  "title": "두리찬방",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 장항동 740-3, 양우로데오랜드",
  "phone": "031-917-8789",
  "open": null,
  "close": null,
  "lat": 37.66367136,
  "long": 126.7657135
 },
 {
  "title": "GS25장항랜드점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 740-3, 양우로데오랜드",
  "phone": "031-917-8847",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66367136,
  "long": 126.7657135
 },
 {
  "title": "씨유(CU) 강선마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 736, 엔트리원프라자",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6645214,
  "long": 126.765611
 },
 {
  "title": "GS25장항드림점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 730-1, 양우로데오시티",
  "phone": "031-924-5575",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66481501,
  "long": 126.7663352
 },
 {
  "title": "GS25성석누리점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 성석동 2176",
  "phone": "031-977-3196",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7055692,
  "long": 126.7821419
 },
 {
  "title": "GS25설문대로점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 설문동 738-10",
  "phone": "031-977-7601",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71784303,
  "long": 126.7894211
 },
 {
  "title": "씨유(CU) 일산중산점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1666-1, 대림프라자",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6836009,
  "long": 126.7785649
 },
 {
  "title": "GS25성석중앙점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 성석동 1227-166",
  "phone": "031-976-1123",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71266233,
  "long": 126.7923835
 },
 {
  "title": "씨유(CU) KH기쁨주유소점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 609-7",
  "phone": "031-977-5156",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66976106,
  "long": 126.8091999
 },
 {
  "title": "이마트24 일산복음병원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 186-2",
  "phone": "031-975-7333",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68191669,
  "long": 126.7800217
 },
 {
  "title": "전티마이베트남쌀국수",
  "category": "분식",
  "address": "경기도 고양시 일산동구 중산동 1688",
  "phone": "031-977-9060",
  "open": null,
  "close": null,
  "lat": 37.68185721,
  "long": 126.7809832
 },
 {
  "title": "이마트24 풍동빌라지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 605-5",
  "phone": "070-7700-1726",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67485288,
  "long": 126.7959802
 },
 {
  "title": "씨유(CU) 일산풍동에이스점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 385-1",
  "phone": "031-903-1122",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6619653,
  "long": 126.7981462
 },
 {
  "title": "이마트24 지영로드점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 지영동 208",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72335779,
  "long": 126.8251752
 },
 {
  "title": "세븐일레븐 일산지영점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 지영동 104",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.72132373,
  "long": 126.8341361
 },
 {
  "title": "파리바케트(일산호수점)",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 장항동 881, 호수마을2단지",
  "phone": "031-903-7919",
  "open": null,
  "close": null,
  "lat": 37.64937138,
  "long": 126.7770628
 },
 {
  "title": "GS25장항호수점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 877, 호수마을3단지",
  "phone": "031-901-1191",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64820265,
  "long": 126.7746096
 },
 {
  "title": "씨유(CU) 일산장항공단인점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 618-6",
  "phone": "031-974-6567",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63598575,
  "long": 126.776789
 },
 {
  "title": "세븐일레븐 일산저동초교점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 682-3",
  "phone": "031-922-1581",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66912698,
  "long": 126.7745795
 },
 {
  "title": "GS25식사국제점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 733-4",
  "phone": "031-965-1393",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68550781,
  "long": 126.8077597
 },
 {
  "title": "세븐일레븐 동국대일산병원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 814",
  "phone": "031-961-9195",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67643678,
  "long": 126.8055658
 },
 {
  "title": "GS25일산동국중앙점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 662-9",
  "phone": "031-964-6605",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6767293,
  "long": 126.8076571
 },
 {
  "title": "이마트24 라페스타1호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 760",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66170958,
  "long": 126.7668757
 },
 {
  "title": "세븐일레븐 정발산이레점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 741-3, 이레빌딩",
  "phone": "031-924-6791",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6624033,
  "long": 126.7669109
 },
 {
  "title": "세븐일레븐 정발산보보점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 776-2, 우림보보카운티",
  "phone": "031-932-2682",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66183286,
  "long": 126.7691134
 },
 {
  "title": "씨유(CU) 라페스타점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 764",
  "phone": "031-963-1628",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66132049,
  "long": 126.768799
 },
 {
  "title": "씨유(CU) 일산삼성캐슬점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 832-15",
  "phone": "031-964-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67807825,
  "long": 126.8001112
 },
 {
  "title": "콩심라페스타점",
  "category": "분식",
  "address": "경기도 고양시 일산동구 장항동 733, 한강세이프빌",
  "phone": "031-923-0098",
  "open": null,
  "close": null,
  "lat": 37.66378385,
  "long": 126.7679053
 },
 {
  "title": "GS25장항세이프빌점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 733, 한강세이프빌",
  "phone": "031-913-3556",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66378385,
  "long": 126.7679053
 },
 {
  "title": "세븐일레븐 일산우인점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 746",
  "phone": "031-912-4536",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6637514,
  "long": 126.7647112
 },
 {
  "title": "세븐일레븐 정발산삼라점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 759-1",
  "phone": "031-904-9666",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66100665,
  "long": 126.7668144
 },
 {
  "title": "씨유(CU) 장항삼라2차점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 759-1",
  "phone": "031-908-9938",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66100665,
  "long": 126.7668144
 },
 {
  "title": "이마트24 일산메르헨점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 752",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.660119,
  "long": 126.7664489
 },
 {
  "title": "세븐일레븐 일산호수그린점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 752-1",
  "phone": "031-901-5960",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65980653,
  "long": 126.7668091
 },
 {
  "title": "GS25정발산점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1219-4",
  "phone": "031-921-2522",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6725417,
  "long": 126.7801054
 },
 {
  "title": "씨유(CU) 정발산건영점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 697",
  "phone": "031-911-5747",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66820951,
  "long": 126.7716294
 },
 {
  "title": "세븐일레븐 일산양지마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 701-5",
  "phone": "031-913-6182",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6666236,
  "long": 126.7732156
 },
 {
  "title": "GS25고양문봉점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 문봉동 217",
  "phone": "031-975-9959",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7067128,
  "long": 126.8167654
 },
 {
  "title": "세븐일레븐 고양연수원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 설문동 1251",
  "phone": "031-975-8562",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71920506,
  "long": 126.815036
 },
 {
  "title": "씨유(CU) SK원일충전소점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 문봉동 195-4",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70993878,
  "long": 126.8192415
 },
 {
  "title": "세븐일레븐 문원로드점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 지영동 413-1",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71422335,
  "long": 126.8189453
 },
 {
  "title": "GS25엠시티2점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 869",
  "phone": "031-931-9300",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65490653,
  "long": 126.7715403
 },
 {
  "title": "씨유(CU) SK사우디제7주유소점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 541-18",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64312121,
  "long": 126.7600402
 },
 {
  "title": "세븐일레븐 일산오렌지주유소점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 541-16",
  "phone": "031-902-2294",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64390832,
  "long": 126.7607583
 },
 {
  "title": "이마트24 일산고양IC점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 514-6",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6657408,
  "long": 126.8127794
 },
 {
  "title": "씨유(CU) 장항한솔점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 852-1",
  "phone": "031-904-9801",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6548244,
  "long": 126.7739413
 },
 {
  "title": "이마트24 풍동오토갤러리점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 144-4",
  "phone": "070-4242-9466",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6622153,
  "long": 126.803953
 },
 {
  "title": "씨유(CU) 일산백송마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1183",
  "phone": "031-906-3901",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64907159,
  "long": 126.788445
 },
 {
  "title": "이마트24 일산백송마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1186",
  "phone": "031-905-0328",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65053297,
  "long": 126.7914778
 },
 {
  "title": "세븐일레븐 일산백마점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1139",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65101629,
  "long": 126.7937519
 },
 {
  "title": "흰돌찬방",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 백석동 1349",
  "phone": "031-902-8789",
  "open": null,
  "close": null,
  "lat": 37.64380019,
  "long": 126.7829759
 },
 {
  "title": "씨유(CU) 백석12블럭점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1211-2",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.647141,
  "long": 126.7859114
 },
 {
  "title": "씨유(CU) 백석8블럭점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1280-4",
  "phone": "031-932-3706",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64561022,
  "long": 126.7875438
 },
 {
  "title": "GS25백석으뜸점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1259",
  "phone": "031-901-9303",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6459473,
  "long": 126.7894367
 },
 {
  "title": "GS25고양센터점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 2-14",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69066725,
  "long": 126.8303722
 },
 {
  "title": "씨유(CU) 일산사리현로점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 사리현동 497",
  "phone": "031-967-3373",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6940874,
  "long": 126.8407074
 },
 {
  "title": "씨유(CU) 일산밤가시점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1353-3",
  "phone": "031-903-7011",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6676087,
  "long": 126.7858636
 },
 {
  "title": "씨유(CU) 정발산행복점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1238-17",
  "phone": "031-913-3652",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6724186,
  "long": 126.7836236
 },
 {
  "title": "씨유(CU) 마두건영점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 870-3",
  "phone": "031-914-1110",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66103063,
  "long": 126.7891188
 },
 {
  "title": "GS25율동로점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1118",
  "phone": "031-925-3302",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6761346,
  "long": 126.7783348
 },
 {
  "title": "GS25일산산두로",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 890",
  "phone": "031-907-0960",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66470796,
  "long": 126.7878475
 },
 {
  "title": "정원",
  "category": "한식",
  "address": "경기도 고양시 일산동구 정발산동 1132-5",
  "phone": "031-919-0319",
  "open": null,
  "close": null,
  "lat": 37.67440199,
  "long": 126.7778041
 },
 {
  "title": "이마트24 정발산하나점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1132-9",
  "phone": "070-8843-3063",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6746065,
  "long": 126.7773076
 },
 {
  "title": "세븐일레븐 정발산본점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1127-4",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6748185,
  "long": 126.7781002
 },
 {
  "title": "길모퉁이",
  "category": "한식",
  "address": "경기도 고양시 일산동구 정발산동 1135-9",
  "phone": "031-916-9182",
  "open": null,
  "close": null,
  "lat": 37.67430156,
  "long": 126.7770381
 },
 {
  "title": "씨유(CU) 고양중산점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 4",
  "phone": "031-975-0174",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.684924,
  "long": 126.7926071
 },
 {
  "title": "GS25고양성석점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 성석동 491-2",
  "phone": "031-977-7404",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7089027,
  "long": 126.8084658
 },
 {
  "title": "씨유(CU) 고양문봉점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 문봉동 164-4",
  "phone": "031-976-2842",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70344854,
  "long": 126.8194587
 },
 {
  "title": "이마트24 일산고봉점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 문봉동 57-6",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.7014401,
  "long": 126.8276215
 },
 {
  "title": "씨유(CU) SK오미산주유소점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 성석동 1256-1",
  "phone": "031-975-5197",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71040111,
  "long": 126.7880026
 },
 {
  "title": "씨유(CU) 동양인재개발원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 성석동 57-1",
  "phone": "031-910-4558",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70047186,
  "long": 126.8126469
 },
 {
  "title": "이마트24 고양사리현점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 사리현동 185-1",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6964433,
  "long": 126.8472082
 },
 {
  "title": "GS25풍동제일점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1261",
  "phone": "031-932-6601",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67134771,
  "long": 126.8010406
 },
 {
  "title": "GS25풍동달맞이점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1237-3",
  "phone": "031-902-4033",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6734055,
  "long": 126.8003413
 },
 {
  "title": "브레드 하우스",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 풍동 1354",
  "phone": "031-921-1449",
  "open": null,
  "close": null,
  "lat": 37.66410828,
  "long": 126.7972633
 },
 {
  "title": "GS25풍동성원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1354",
  "phone": "031-904-4626",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66410828,
  "long": 126.7972633
 },
 {
  "title": "파리바게뜨 풍동미르점",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 풍동 1292-1",
  "phone": "031-906-8295",
  "open": null,
  "close": null,
  "lat": 37.66371471,
  "long": 126.7968652
 },
 {
  "title": "세븐일레븐 풍동미르점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1292-1",
  "phone": "031-908-1398",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66371471,
  "long": 126.7968652
 },
 {
  "title": "파리바게트(풍동로데오점)",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 풍동 1279-4",
  "phone": "031-904-0405",
  "open": null,
  "close": null,
  "lat": 37.6673452,
  "long": 126.7997142
 },
 {
  "title": "세븐일레븐 풍동본점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1279-4",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6673452,
  "long": 126.7997142
 },
 {
  "title": "천하일미김밥전문점",
  "category": "분식",
  "address": "경기도 고양시 일산동구 풍동 1274-1",
  "phone": "031-905-8222",
  "open": null,
  "close": null,
  "lat": 37.66762647,
  "long": 126.799833
 },
 {
  "title": "풍동시골장터",
  "category": "한식",
  "address": "경기도 고양시 일산동구 풍동 1274-1",
  "phone": "031-902-3545",
  "open": null,
  "close": null,
  "lat": 37.66762647,
  "long": 126.799833
 },
 {
  "title": "반찬전문점미복",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 풍동 1274",
  "phone": "031-901-9689",
  "open": null,
  "close": null,
  "lat": 37.6678164,
  "long": 126.7998269
 },
 {
  "title": "GS25풍동위브점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1297-3",
  "phone": "031-902-7101",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6660341,
  "long": 126.8001627
 },
 {
  "title": "씨유(CU) 일산풍동9단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1242-11",
  "phone": "031-904-1902",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6728544,
  "long": 126.8021715
 },
 {
  "title": "이마트24 일산풍동숲속점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1245",
  "phone": "031-901-4011",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6730267,
  "long": 126.798742
 },
 {
  "title": "북경성",
  "category": "중식",
  "address": "경기도 고양시 일산동구 풍동 1276-1",
  "phone": "031-904-5482",
  "open": null,
  "close": null,
  "lat": 37.6677351,
  "long": 126.8014842
 },
 {
  "title": "허니베이커리",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 풍동 1278",
  "phone": "031-907-8810",
  "open": null,
  "close": null,
  "lat": 37.66732102,
  "long": 126.8003804
 },
 {
  "title": "한솥(풍동점)",
  "category": "분식",
  "address": "경기도 고양시 일산동구 풍동 1279-3",
  "phone": "031-904-5949",
  "open": null,
  "close": null,
  "lat": 37.6673169,
  "long": 126.7993464
 },
 {
  "title": "씨유(CU) 풍동투데이점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1285-2",
  "phone": "031-901-9053",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66561768,
  "long": 126.7969163
 },
 {
  "title": "씨유(CU) 풍동5단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1273",
  "phone": "031-902-6025",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66794168,
  "long": 126.7987195
 },
 {
  "title": "세븐일레븐 일산풍동두산점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 1268",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66838325,
  "long": 126.7956307
 },
 {
  "title": "씨유(CU) 풍동애니골점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 666-7",
  "phone": "031-901-5335",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6698624,
  "long": 126.7910067
 },
 {
  "title": "세븐일레븐 일산애니골점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 573-16",
  "phone": "031-907-8975",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.671547,
  "long": 126.7912288
 },
 {
  "title": "씨유(CU) 중산약산마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 26-2",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67932554,
  "long": 126.7919605
 },
 {
  "title": "쟈스민",
  "category": "중식",
  "address": "경기도 고양시 일산동구 중산동 18",
  "phone": "031-976-2552",
  "open": null,
  "close": null,
  "lat": 37.68296972,
  "long": 126.7923257
 },
 {
  "title": "이마트24 일산스타타워점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1580-4",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67457821,
  "long": 126.8084091
 },
 {
  "title": "세븐일레븐 일산식사블루밍점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1565",
  "phone": "031-965-7863",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67644919,
  "long": 126.8109843
 },
 {
  "title": "GS25식사도서관점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1557",
  "phone": "031-969-5509",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67623856,
  "long": 126.8145124
 },
 {
  "title": "GS25식사중앙공원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1543",
  "phone": "031-969-8285",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67698475,
  "long": 126.8123477
 },
 {
  "title": "이마트24 식사스타타워점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1531",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67793948,
  "long": 126.8121594
 },
 {
  "title": "GS25자이베스트점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1529",
  "phone": "031-966-3228",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67879437,
  "long": 126.8126379
 },
 {
  "title": "GS25식사자이2점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1504",
  "phone": "031-967-2998",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67883552,
  "long": 126.8158844
 },
 {
  "title": "GS25식사자이점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1487",
  "phone": "031-967-6804",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68437953,
  "long": 126.8109453
 },
 {
  "title": "씨유(CU) 식사자이점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1487",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68437953,
  "long": 126.8109453
 },
 {
  "title": "세븐일레븐 일산식사점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 1525",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6774437,
  "long": 126.8105024
 },
 {
  "title": "씨유(CU) 풍산트윈시티점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 670-28",
  "phone": "031-965-1979",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6787317,
  "long": 126.8111688
 },
 {
  "title": "씨유(CU) 일산은마길점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 설문동 494-10",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.71416547,
  "long": 126.8074362
 },
 {
  "title": "요리왕",
  "category": "중식",
  "address": "경기도 고양시 일산동구 식사동 937-9",
  "phone": "031-904-8259",
  "open": null,
  "close": null,
  "lat": 37.66695208,
  "long": 126.8060913
 },
 {
  "title": "세븐일레븐 일산은행마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 식사동 857",
  "phone": "031-965-0464",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67140005,
  "long": 126.8062185
 },
 {
  "title": "씨유(CU) 일산풍동동문점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 풍동 184-19",
  "phone": "031-907-0966",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66440703,
  "long": 126.8056019
 },
 {
  "title": "세븐일레븐 일산백석본점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1344",
  "phone": "031-905-2154",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64082944,
  "long": 126.7844847
 },
 {
  "title": "주식회사 후앙",
  "category": "중식",
  "address": "경기도 고양시 일산동구 백석동 1146-3",
  "phone": "031-901-5527",
  "open": null,
  "close": null,
  "lat": 37.6489284,
  "long": 126.7928355
 },
 {
  "title": "진냉면N돈까스",
  "category": "분식",
  "address": "경기도 고양시 일산동구 마두동 730-5",
  "phone": "031-905-6111",
  "open": null,
  "close": null,
  "lat": 37.65396621,
  "long": 126.7907429
 },
 {
  "title": "GS25백마2단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 739",
  "phone": "031-901-0471",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65408144,
  "long": 126.7886665
 },
 {
  "title": "뚜레쥬르 마두점",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 마두동 729",
  "phone": "031-908-6003",
  "open": null,
  "close": null,
  "lat": 37.6549071,
  "long": 126.7901503
 },
 {
  "title": "명가찬방",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 마두동 729",
  "phone": "031-965-9933",
  "open": null,
  "close": null,
  "lat": 37.6549071,
  "long": 126.7901503
 },
 {
  "title": "GS25마두백마점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 729",
  "phone": "031-901-8504",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6549071,
  "long": 126.7901503
 },
 {
  "title": "황기순칼국수 백마점",
  "category": "한식",
  "address": "경기도 고양시 일산동구 마두동 724",
  "phone": "031-902-8688",
  "open": null,
  "close": null,
  "lat": 37.6567548,
  "long": 126.7890777
 },
 {
  "title": "롯데리아일산마두점",
  "category": "패스트푸드",
  "address": "경기도 고양시 일산동구 마두동 752",
  "phone": "031-904-2356",
  "open": null,
  "close": null,
  "lat": 37.65733449,
  "long": 126.7879412
 },
 {
  "title": "GS25백마스타점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 752",
  "phone": "080-855-5525",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65733449,
  "long": 126.7879412
 },
 {
  "title": "씨유(CU) 마두서진점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 755",
  "phone": "031-903-0348",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65715694,
  "long": 126.7874112
 },
 {
  "title": "GS25백석효성점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1309-1",
  "phone": "031-901-1160",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64146423,
  "long": 126.7867444
 },
 {
  "title": "씨유(CU) 국립암센터점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 809",
  "phone": "031-920-0317",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66322585,
  "long": 126.7833999
 },
 {
  "title": "파리바게뜨(국립암센터점)",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 마두동 857",
  "phone": "031-901-8252",
  "open": null,
  "close": null,
  "lat": 37.6647046,
  "long": 126.7843616
 },
 {
  "title": "씨유(CU) 백석우림점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1309",
  "phone": "031-812-1668",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64185444,
  "long": 126.7872871
 },
 {
  "title": "중화루",
  "category": "중식",
  "address": "경기도 고양시 일산동구 정발산동 1146-2",
  "phone": "031-922-8008",
  "open": null,
  "close": null,
  "lat": 37.6733339,
  "long": 126.7770823
 },
 {
  "title": "밤가시토굽사",
  "category": "한식",
  "address": "경기도 고양시 일산동구 정발산동 1145-3",
  "phone": "031-911-0098",
  "open": null,
  "close": null,
  "lat": 37.67371074,
  "long": 126.7762532
 },
 {
  "title": "김가네",
  "category": "분식",
  "address": "경기도 고양시 일산동구 백석동 1308",
  "phone": "031-908-1005",
  "open": null,
  "close": null,
  "lat": 37.6423201,
  "long": 126.7878855
 },
 {
  "title": "세븐일레븐 백석역점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1308",
  "phone": "031-932-3478",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6423201,
  "long": 126.7878855
 },
 {
  "title": "GS25백석본점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1283-1",
  "phone": "070-4121-8757",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.644239,
  "long": 126.789007
 },
 {
  "title": "GS25백석터미널점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1239-2",
  "phone": "031-905-3959",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6441372,
  "long": 126.7909289
 },
 {
  "title": "세븐일레븐 고양종합터미널점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1241-2",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6445178,
  "long": 126.7904435
 },
 {
  "title": "씨유(CU) 일산백석건영2호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1152",
  "phone": "031-908-9056",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6493554,
  "long": 126.7915039
 },
 {
  "title": "씨유(CU) 백석건영점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1152-5",
  "phone": "031-908-9053",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64863817,
  "long": 126.7919547
 },
 {
  "title": "세븐일레븐 일산정발고점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 892-6",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6642206,
  "long": 126.7866295
 },
 {
  "title": "씨유(CU) 마두25블럭점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 854-5",
  "phone": "031-906-9064",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6642371,
  "long": 126.7850108
 },
 {
  "title": "씨유(CU) 정발산으뜸점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1340-5",
  "phone": "031-908-2222",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6673546,
  "long": 126.7835993
 },
 {
  "title": "세븐일레븐 일산정발밤가시점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1227-3",
  "phone": "031-915-7714",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6734297,
  "long": 126.7801566
 },
 {
  "title": "황가네분식",
  "category": "분식",
  "address": "경기도 고양시 일산동구 정발산동 1247-13",
  "phone": "031-905-2626",
  "open": null,
  "close": null,
  "lat": 37.67432327,
  "long": 126.7800156
 },
 {
  "title": "씨유(CU) 고양새싹가게2호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1195-9",
  "phone": "031-912-1817",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67201806,
  "long": 126.7768694
 },
 {
  "title": "김가네김밥",
  "category": "분식",
  "address": "경기도 고양시 일산동구 정발산동 1203",
  "phone": "031-915-7449",
  "open": null,
  "close": null,
  "lat": 37.6728487,
  "long": 126.7774671
 },
 {
  "title": "GS25일산대산점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1181-13",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66990682,
  "long": 126.7753171
 },
 {
  "title": "GS25정발산공원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 정발산동 1161",
  "phone": "031-923-1724",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67220795,
  "long": 126.774401
 },
 {
  "title": "손수제비",
  "category": "한식",
  "address": "경기도 고양시 일산동구 정발산동 1162-2",
  "phone": "031-919-4588",
  "open": null,
  "close": null,
  "lat": 37.6716316,
  "long": 126.7740185
 },
 {
  "title": "오봉도시락마두역점",
  "category": "분식",
  "address": "경기도 고양시 일산동구 장항동 895-1",
  "phone": "031-907-5982",
  "open": null,
  "close": null,
  "lat": 37.6512347,
  "long": 126.7771484
 },
 {
  "title": "씨유(CU) 백석루벤스카운티점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1313",
  "phone": "031-908-5587",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64017486,
  "long": 126.7892135
 },
 {
  "title": "GS25일산백석점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1302",
  "phone": "031-932-0618",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6406357,
  "long": 126.7897745
 },
 {
  "title": "씨유(CU) 일산설문점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 설문동 167-63",
  "phone": "031-977-9397",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70862516,
  "long": 126.8111693
 },
 {
  "title": "세븐일레븐 장항공단점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 566-3",
  "phone": "031-903-7422",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64263668,
  "long": 126.7682379
 },
 {
  "title": "GS25장항우리점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 540-8",
  "phone": "031-907-2518",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6450457,
  "long": 126.7629782
 },
 {
  "title": "GS25장항일호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 863-2",
  "phone": "031-901-2511",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6565186,
  "long": 126.7701645
 },
 {
  "title": "유가네 닭갈비",
  "category": "한식",
  "address": "경기도 고양시 일산동구 장항동 862",
  "phone": "031-907-7887",
  "open": null,
  "close": null,
  "lat": 37.65694637,
  "long": 126.7711789
 },
 {
  "title": "GS25웨스턴돔점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 868",
  "phone": "031-931-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65589569,
  "long": 126.7720388
 },
 {
  "title": "씨유(CU) 일산웨스턴돔점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 868",
  "phone": "031-902-7066",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65589569,
  "long": 126.7720388
 },
 {
  "title": "씨유(CU) 장항낙원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 856-3",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6571362,
  "long": 126.7725422
 },
 {
  "title": "GS25마두으뜸점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 882-7",
  "phone": "031-909-1125",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66291601,
  "long": 126.7874017
 },
 {
  "title": "GS25장항신성점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 854",
  "phone": "080-855-5525",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65618377,
  "long": 126.7737461
 },
 {
  "title": "김밥매니아",
  "category": "분식",
  "address": "경기도 고양시 일산동구 중산동 1691",
  "phone": "031-976-5582",
  "open": null,
  "close": null,
  "lat": 37.68121919,
  "long": 126.7809126
 },
 {
  "title": "피엠푸드 중산하늘마을점",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 중산동 1691",
  "phone": "031-975-1056",
  "open": null,
  "close": null,
  "lat": 37.68121919,
  "long": 126.7809126
 },
 {
  "title": "GS25중산현해점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1692",
  "phone": "031-965-6975",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.681357,
  "long": 126.7813123
 },
 {
  "title": "롯데리아 일산중산점",
  "category": "패스트푸드",
  "address": "경기도 고양시 일산동구 중산동 1561",
  "phone": "031-976-0642",
  "open": null,
  "close": null,
  "lat": 37.69389304,
  "long": 126.7803221
 },
 {
  "title": "씨유(CU) 중산중앙점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1560-1",
  "phone": "031-977-5288",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6941102,
  "long": 126.7804073
 },
 {
  "title": "파리바게트 중산마을점",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 중산동 1568-3",
  "phone": "031-976-0459",
  "open": null,
  "close": null,
  "lat": 37.69402395,
  "long": 126.7809458
 },
 {
  "title": "이삭토스트",
  "category": "분식",
  "address": "경기도 고양시 일산동구 중산동 1560",
  "phone": "031-977-2492",
  "open": null,
  "close": null,
  "lat": 37.69440507,
  "long": 126.7804623
 },
 {
  "title": "세븐일레븐 일산중산본점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1568-2",
  "phone": "031-975-4206",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6941298,
  "long": 126.7810014
 },
 {
  "title": "뚜레쥬르 일산중산점",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 중산동 1568-1",
  "phone": "031-975-1335",
  "open": null,
  "close": null,
  "lat": 37.69431958,
  "long": 126.7810044
 },
 {
  "title": "GS25중산코오롱점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1556",
  "phone": "031-977-2625",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69470425,
  "long": 126.7805101
 },
 {
  "title": "씨유(CU) 일산IPARK동문점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1841",
  "phone": "031-976-1823",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67885528,
  "long": 126.7829963
 },
 {
  "title": "씨유(CU) 일산IPARK서문점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1841",
  "phone": "031-976-1822",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67885528,
  "long": 126.7829963
 },
 {
  "title": "떡볶이 No.5",
  "category": "분식",
  "address": "경기도 고양시 일산동구 중산동 1680",
  "phone": "031-977-7997",
  "open": null,
  "close": null,
  "lat": 37.68093102,
  "long": 126.7809905
 },
 {
  "title": "GS25중산산들점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1664-4",
  "phone": "031-976-2524",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6843414,
  "long": 126.778987
 },
 {
  "title": "씨유(CU) 백석밀라트점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1303",
  "phone": "031-904-9689",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6409201,
  "long": 126.7901177
 },
 {
  "title": "세븐일레븐 고양터미널점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1242",
  "phone": "031-936-7495",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64317774,
  "long": 126.7896628
 },
 {
  "title": "씨유(CU) 백석역점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1331",
  "phone": "031-906-6588",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64310845,
  "long": 126.7871684
 },
 {
  "title": "세븐일레븐 백석나들점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1297-2",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6436208,
  "long": 126.7878485
 },
 {
  "title": "GS25백석21C점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1332",
  "phone": "031-903-7250",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.64392466,
  "long": 126.7861605
 },
 {
  "title": "GS25마두역점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 마두동 805-1",
  "phone": "031-907-9925",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6509173,
  "long": 126.7788939
 },
 {
  "title": "씨유(CU) 일산마두역점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 890-7",
  "phone": "031-907-1478",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65261818,
  "long": 126.7768691
 },
 {
  "title": "GS25장항마이다스점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 775-1",
  "phone": "031-905-2649",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66151678,
  "long": 126.7696542
 },
 {
  "title": "GS25일산레이크점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 727-2",
  "phone": "031-901-8643",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6646409,
  "long": 126.7683224
 },
 {
  "title": "세븐일레븐 일산장항쌍용점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 727-1",
  "phone": "031-919-0905",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66499118,
  "long": 126.7679308
 },
 {
  "title": "뚜레쥬르백석밀라트점",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 백석동 1300",
  "phone": "031-905-9845",
  "open": null,
  "close": null,
  "lat": 37.64039763,
  "long": 126.7908626
 },
 {
  "title": "세븐일레븐 정발산광장점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 857",
  "phone": "031-904-0958",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65826826,
  "long": 126.7726571
 },
 {
  "title": "세븐일레븐 일산웨스턴점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 861",
  "phone": "031-901-1454",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6575411,
  "long": 126.7708412
 },
 {
  "title": "이마트24 일산웨스턴돔점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 864-1",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65711423,
  "long": 126.7703718
 },
 {
  "title": "씨유(CU) 일산광장점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 769-2",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65925034,
  "long": 126.7698415
 },
 {
  "title": "GS25R일산마사4층점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 756-4",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6595584,
  "long": 126.7684166
 },
 {
  "title": "GS25R일산마사5층점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 756-4",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6595584,
  "long": 126.7684166
 },
 {
  "title": "GS25R일산마사6층점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 756-4",
  "phone": "031-907-3156",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6595584,
  "long": 126.7684166
 },
 {
  "title": "GS25지영로점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 지영동 375-16",
  "phone": "031-976-8715",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70668034,
  "long": 126.8236631
 },
 {
  "title": "GS25중산누리점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1573",
  "phone": "031-977-1724",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69206618,
  "long": 126.7824498
 },
 {
  "title": "세븐일레븐 고양중산동신점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1566",
  "phone": "031-977-9335",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6875583,
  "long": 126.778894
 },
 {
  "title": "GS25중산영원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1582",
  "phone": "031-976-3817",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68721454,
  "long": 126.780063
 },
 {
  "title": "파리바케트중산행복점",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 중산동 1579-3",
  "phone": "070-8828-0992",
  "open": null,
  "close": null,
  "lat": 37.68713685,
  "long": 126.7790086
 },
 {
  "title": "세븐일레븐 일산중산점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1566",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6875583,
  "long": 126.778894
 },
 {
  "title": "씨유(CU) 중산동신점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1579",
  "phone": "031-976-5434",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68711062,
  "long": 126.7784299
 },
 {
  "title": "씨유(CU) 일산중산하늘점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1801",
  "phone": "1577-3663",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6767291,
  "long": 126.7843581
 },
 {
  "title": "든든한 김밥",
  "category": "분식",
  "address": "경기도 고양시 일산동구 중산동 1813",
  "phone": "031-976-4791",
  "open": null,
  "close": null,
  "lat": 37.67501372,
  "long": 126.7870656
 },
 {
  "title": "파리바게트(풍산점)",
  "category": "제과점",
  "address": "경기도 고양시 일산동구 중산동 1806",
  "phone": "031-976-0049",
  "open": null,
  "close": null,
  "lat": 37.67451447,
  "long": 126.7860067
 },
 {
  "title": "씨유(CU) 일산하늘마을5단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1800",
  "phone": "031-977-6425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67580789,
  "long": 126.7877933
 },
 {
  "title": "세븐일레븐 중산성원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1812",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67474242,
  "long": 126.7865086
 },
 {
  "title": "씨유(CU) 일산트리플라온점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1682",
  "phone": "031-926-7436",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.678979,
  "long": 126.7794684
 },
 {
  "title": "씨유(CU) 중산원룸점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1729-1",
  "phone": "031-977-3371",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6836544,
  "long": 126.7880271
 },
 {
  "title": "세븐일레븐 일산안곡고점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1717",
  "phone": "031-975-6218",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68243659,
  "long": 126.786414
 },
 {
  "title": "GS25일산하늘점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1700",
  "phone": "080-855-5525",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68127783,
  "long": 126.7853608
 },
 {
  "title": "이마트24 중산아이파크점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 중산동 1707-5",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6799533,
  "long": 126.7857713
 },
 {
  "title": "씨유(CU) EBS일산사옥점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 1775",
  "phone": "02-526-2951",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66172433,
  "long": 126.7546265
 },
 {
  "title": "세븐일레븐 백석브라운스톤점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1330",
  "phone": "031-901-7295",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63760986,
  "long": 126.7877462
 },
 {
  "title": "씨유(CU) 함께여는가게1호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1330",
  "phone": "031-930-8484",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63760986,
  "long": 126.7877462
 },
 {
  "title": "굿모닝찬방",
  "category": "반찬",
  "address": "경기도 고양시 일산동구 백석동 1320",
  "phone": "031-907-3316",
  "open": null,
  "close": null,
  "lat": 37.6388567,
  "long": 126.7875859
 },
 {
  "title": "세븐일레븐 백석비잔티움점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1318",
  "phone": "031-901-6470",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63872896,
  "long": 126.7888097
 },
 {
  "title": "세븐일레븐 백석동문오피스점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1324",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.63992793,
  "long": 126.7861621
 },
 {
  "title": "세븐일레븐 고양꽃박람회점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 906",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65384593,
  "long": 126.7687814
 },
 {
  "title": "세븐일레븐 일산MBC드림센터점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 869",
  "phone": "031-901-8620",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65553588,
  "long": 126.7704806
 },
 {
  "title": "세븐일레븐 일산엠시티점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 869",
  "phone": "031-931-8711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65553588,
  "long": 126.7704806
 },
 {
  "title": "GS25장항레이크점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 753",
  "phone": "031-901-8643",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.65923817,
  "long": 126.7673458
 },
 {
  "title": "세븐일레븐 일산호수공원2호점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 749",
  "phone": "031-922-7200",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66266963,
  "long": 126.7639849
 },
 {
  "title": "세븐일레븐 일산호수공원점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 749",
  "phone": "031-903-7000",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66266963,
  "long": 126.7639849
 },
 {
  "title": "세븐일레븐 일산공원분수점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 장항동 906",
  "phone": "031-911-0925",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66444643,
  "long": 126.7604431
 },
 {
  "title": "세븐일레븐 백석중앙점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1447",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6450542,
  "long": 126.7793596
 },
 {
  "title": "GS25백석호수점",
  "category": "편의점",
  "address": "경기도 고양시 일산동구 백석동 1416",
  "phone": "031-901-3953",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6463407,
  "long": 126.7809193
 },
 {
  "title": "GS25 가좌벽산점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 가좌동 1087",
  "phone": "031-912-3359",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69098128,
  "long": 126.7207886
 },
 {
  "title": "GS25 가좌으뜸점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 가좌동 1086",
  "phone": "031-922-0342",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68855652,
  "long": 126.7225981
 },
 {
  "title": "GS25 가좌대우점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 가좌동 1089",
  "phone": "031-922-0829",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68844225,
  "long": 126.7169751
 },
 {
  "title": "맘&찬",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 주엽동 102",
  "phone": "031-911-8244",
  "open": null,
  "close": null,
  "lat": 37.66875543,
  "long": 126.7633762
 },
 {
  "title": "왕순이주먹밥김밥(주엽점)",
  "category": "분식",
  "address": "경기도 고양시 일산서구 주엽동 102",
  "phone": "031-915-5094",
  "open": null,
  "close": null,
  "lat": 37.6687173,
  "long": 126.7633528
 },
 {
  "title": "행복한식탁장바구니",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 주엽동 67",
  "phone": "031-919-0891",
  "open": null,
  "close": null,
  "lat": 37.67033996,
  "long": 126.7627734
 },
 {
  "title": "세븐일레븐 주엽금강점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 67",
  "phone": "031-924-3342",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67033996,
  "long": 126.7627734
 },
 {
  "title": "GS25 주엽역점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 66",
  "phone": "031-915-0620",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6705352,
  "long": 126.7621233
 },
 {
  "title": "세븐일레븐 일산주엽점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 18-1",
  "phone": "031-917-6965",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6717342,
  "long": 126.7593535
 },
 {
  "title": "북경",
  "category": "중식",
  "address": "경기도 고양시 일산서구 대화동 2215",
  "phone": "031-916-1990",
  "open": null,
  "close": null,
  "lat": 37.67732213,
  "long": 126.7478235
 },
 {
  "title": "피자스쿨(대화역점)",
  "category": "양식",
  "address": "경기도 고양시 일산서구 대화동 2215",
  "phone": "031-911-2345",
  "open": null,
  "close": null,
  "lat": 37.67732213,
  "long": 126.7478235
 },
 {
  "title": "행복한밥상",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 대화동 2215",
  "phone": "031-917-0947",
  "open": null,
  "close": null,
  "lat": 37.67732213,
  "long": 126.7478235
 },
 {
  "title": "이마트24 일산대화점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2215",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67732213,
  "long": 126.7478235
 },
 {
  "title": "세븐일레븐 일산주엽고점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2173-6",
  "phone": "031-294-5276",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6749458,
  "long": 126.7543576
 },
 {
  "title": "GS25 일산역점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1072",
  "phone": "031-913-2508",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6811522,
  "long": 126.7693158
 },
 {
  "title": "올떡볶이",
  "category": "분식",
  "address": "경기도 고양시 일산서구 일산동 555-1",
  "phone": "031-975-8248",
  "open": null,
  "close": null,
  "lat": 37.68523787,
  "long": 126.7772366
 },
 {
  "title": "씨유(CU) 일산스타점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 555-1",
  "phone": "031-976-7575",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68523787,
  "long": 126.7772366
 },
 {
  "title": "이마트24 일산동문점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 973-31",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68632344,
  "long": 126.7628578
 },
 {
  "title": "동문분식",
  "category": "분식",
  "address": "경기도 고양시 일산서구 일산동 957-3",
  "phone": "031-921-3322",
  "open": null,
  "close": null,
  "lat": 37.68603942,
  "long": 126.7650037
 },
 {
  "title": "씨유(CU) 일산동문점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 957-3",
  "phone": "031-911-2004",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68603942,
  "long": 126.7650037
 },
 {
  "title": "세븐일레븐 일산태영점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 954",
  "phone": "070-4111-6823",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68578108,
  "long": 126.7655759
 },
 {
  "title": "천하일미김밥전문점",
  "category": "분식",
  "address": "경기도 고양시 일산서구 일산동 623",
  "phone": "031-977-7444",
  "open": null,
  "close": null,
  "lat": 37.68460046,
  "long": 126.7699712
 },
 {
  "title": "씨유(CU) 일산일등점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 632",
  "phone": "031-975-2341",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6837469,
  "long": 126.7719081
 },
 {
  "title": "GS25 산들점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 525-21",
  "phone": "031-975-8008",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.682549,
  "long": 126.7761731
 },
 {
  "title": "뚜레쥬르(일산산들점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 일산동 1673-1",
  "phone": "031-918-5111",
  "open": null,
  "close": null,
  "lat": 37.68279969,
  "long": 126.7765868
 },
 {
  "title": "세븐일레븐 일산이산포IC점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 법곳동 256-25",
  "phone": "031-919-7719",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66058427,
  "long": 126.7246186
 },
 {
  "title": "세븐일레븐 대화아이파크점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2582",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66928952,
  "long": 126.7349066
 },
 {
  "title": "씨유(CU) 일산역점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 655-38",
  "phone": "031-976-8320",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6839181,
  "long": 126.7689504
 },
 {
  "title": "GS25 일산구산점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 구산동 370",
  "phone": "031-921-9393",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69413732,
  "long": 126.7041321
 },
 {
  "title": "파리바게뜨(백마프라자점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 주엽동 51-1",
  "phone": "031-911-8203",
  "open": null,
  "close": null,
  "lat": 37.6738248,
  "long": 126.7645118
 },
 {
  "title": "GS25 강선마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 30-2",
  "phone": "031-922-6482",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6742008,
  "long": 126.7636086
 },
 {
  "title": "파리바게뜨(대화성저점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 대화동 2127-1",
  "phone": "031-922-8302",
  "open": null,
  "close": null,
  "lat": 37.6787957,
  "long": 126.7544305
 },
 {
  "title": "GS25 주엽고점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2148-14",
  "phone": "031-914-0344",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67691111,
  "long": 126.7545764
 },
 {
  "title": "세븐일레븐 대화본점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2130",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67932816,
  "long": 126.7540017
 },
 {
  "title": "씨유(CU) 대화도서관점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2133",
  "phone": "031-911-2301",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6803405,
  "long": 126.7535396
 },
 {
  "title": "마이봉김밥",
  "category": "분식",
  "address": "경기도 고양시 일산서구 대화동 2570",
  "phone": "031-925-4791",
  "open": null,
  "close": null,
  "lat": 37.67369276,
  "long": 126.7361831
 },
 {
  "title": "GS25 대화마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 739-8",
  "phone": "031-912-3811",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6734242,
  "long": 126.7353269
 },
 {
  "title": "GS25 대화명성점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 863-16",
  "phone": "031-924-8080",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6699583,
  "long": 126.734505
 },
 {
  "title": "59쌀피자(대화마을)",
  "category": "양식",
  "address": "경기도 고양시 일산서구 대화동 866",
  "phone": "031-922-5982",
  "open": null,
  "close": null,
  "lat": 37.670208,
  "long": 126.7347672
 },
 {
  "title": "롯데리아",
  "category": "패스트푸드",
  "address": "경기도 고양시 일산서구 대화동 867-2",
  "phone": "031-911-3990",
  "open": null,
  "close": null,
  "lat": 37.6706089,
  "long": 126.7352727
 },
 {
  "title": "세븐일레븐 대화레포츠공원점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 762-7",
  "phone": "031-911-3832",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6718333,
  "long": 126.7366122
 },
 {
  "title": "세븐일레븐 일산성저마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2085-1",
  "phone": "031-916-4226",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68271893,
  "long": 126.7520358
 },
 {
  "title": "세븐일레븐 일산가좌점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 가좌동 103-8",
  "phone": "070-4036-5381",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6948506,
  "long": 126.7239259
 },
 {
  "title": "GS25 덕이송윤점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 1044-16",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69621269,
  "long": 126.7374001
 },
 {
  "title": "세븐일레븐 씨너스점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 219-8",
  "phone": "031-917-6072",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68948657,
  "long": 126.7570214
 },
 {
  "title": "이마트24 일산덕이로점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 1045-1",
  "phone": "031-925-2645",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69632762,
  "long": 126.7388393
 },
 {
  "title": "이마트24 일산덕이점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 548",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69312684,
  "long": 126.7468612
 },
 {
  "title": "GS25 일산삼익점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 2103",
  "phone": "031-917-8123",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6892406,
  "long": 126.7632989
 },
 {
  "title": "피자마루",
  "category": "양식",
  "address": "경기도 고양시 일산서구 탄현동 1577-4",
  "phone": "031-913-3003",
  "open": null,
  "close": null,
  "lat": 37.6895566,
  "long": 126.7632193
 },
 {
  "title": "GS25 일산삼성점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1898",
  "phone": "031-977-1798",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6895011,
  "long": 126.776264
 },
 {
  "title": "GS25 탄현파워점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1575-6",
  "phone": "031-921-1575",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6897445,
  "long": 126.7626284
 },
 {
  "title": "내사랑내곁에",
  "category": "한식",
  "address": "경기도 고양시 일산서구 일산동 2033",
  "phone": "031-911-0133",
  "open": null,
  "close": null,
  "lat": 37.6898075,
  "long": 126.7700322
 },
 {
  "title": "김밥나라",
  "category": "분식",
  "address": "경기도 고양시 일산서구 일산동 2023",
  "phone": "031-915-9178",
  "open": null,
  "close": null,
  "lat": 37.68942413,
  "long": 126.7708251
 },
 {
  "title": "GS25 대화건영점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2072-7",
  "phone": "031-911-5529",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68520624,
  "long": 126.7558007
 },
 {
  "title": "이마트24 일산가좌로드점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 가좌동 299-7",
  "phone": "031-923-3896",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6840409,
  "long": 126.7174053
 },
 {
  "title": "GS25 송산로점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 937-34",
  "phone": "031-918-9525",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68882072,
  "long": 126.7340344
 },
 {
  "title": "마루김밥",
  "category": "분식",
  "address": "경기도 고양시 일산서구 대화동 2024-7",
  "phone": "031-911-1457",
  "open": null,
  "close": null,
  "lat": 37.6833335,
  "long": 126.7577114
 },
 {
  "title": "GS25 일산시티점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 576-31",
  "phone": "031-975-6467",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68524565,
  "long": 126.7756913
 },
 {
  "title": "한솥도시락(일산시장점)",
  "category": "분식",
  "address": "경기도 고양시 일산서구 일산동 615-3",
  "phone": "031-975-5252",
  "open": null,
  "close": null,
  "lat": 37.68621607,
  "long": 126.7705221
 },
 {
  "title": "이마트24 일산동양점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 962-7",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68680385,
  "long": 126.7688032
 },
 {
  "title": "세븐일레븐 일산후곡현대점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1090",
  "phone": "031-911-3071",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67499969,
  "long": 126.7726968
 },
 {
  "title": "GS25 일산후곡점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1082-2",
  "phone": "031-919-3581",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.676648,
  "long": 126.7694088
 },
 {
  "title": "세븐일레븐 일산후곡마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1084-5",
  "phone": "031-917-7110",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6771451,
  "long": 126.768245
 },
 {
  "title": "피자스쿨",
  "category": "양식",
  "address": "경기도 고양시 일산서구 일산동 1079-1",
  "phone": "031-912-5454",
  "open": null,
  "close": null,
  "lat": 37.67793661,
  "long": 126.7680092
 },
 {
  "title": "유가네닭갈비일산후곡점",
  "category": "한식",
  "address": "경기도 고양시 일산서구 일산동 1084",
  "phone": "031-915-5118",
  "open": null,
  "close": null,
  "lat": 37.67754625,
  "long": 126.7674473
 },
 {
  "title": "세븐일레븐 일산후곡점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1079",
  "phone": "031-919-1996",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6780171,
  "long": 126.7678039
 },
 {
  "title": "씨유(CU) 일산메트로점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1062-1",
  "phone": "031-916-0360",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67804116,
  "long": 126.7662085
 },
 {
  "title": "오빠네옛날떡볶이",
  "category": "분식",
  "address": "경기도 고양시 일산서구 일산동 1062-1",
  "phone": "031-914-1254",
  "open": null,
  "close": null,
  "lat": 37.67814891,
  "long": 126.7660307
 },
 {
  "title": "GS25 일산금호점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1064-3",
  "phone": "031-918-5162",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6788333,
  "long": 126.765906
 },
 {
  "title": "뚜레쥬르(후곡마을점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 일산동 1064-1",
  "phone": "031-913-0088",
  "open": null,
  "close": null,
  "lat": 37.6790544,
  "long": 126.7654054
 },
 {
  "title": "씨유(CU) 일산후곡점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1065-1",
  "phone": "031-912-5060",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6794616,
  "long": 126.7644622
 },
 {
  "title": "본가짜장",
  "category": "중식",
  "address": "경기도 고양시 일산서구 일산동 1054-1",
  "phone": "031-917-2285",
  "open": null,
  "close": null,
  "lat": 37.67954088,
  "long": 126.7628326
 },
 {
  "title": "GS25 성저공원점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2106",
  "phone": "031-911-2609",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68205901,
  "long": 126.757049
 },
 {
  "title": "세븐일레븐 대화새말공원점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2015",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68383843,
  "long": 126.7583488
 },
 {
  "title": "GS25 탄현제일점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1868",
  "phone": "031-918-9995",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6888017,
  "long": 126.7745953
 },
 {
  "title": "세븐일레븐 일산연안점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 583-36",
  "phone": "031-977-1878",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68813439,
  "long": 126.7748017
 },
 {
  "title": "GS25 일산현대점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 640-33",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68520394,
  "long": 126.7726598
 },
 {
  "title": "파리바게뜨(일산역점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 일산동 612-30",
  "phone": "031-976-3403",
  "open": null,
  "close": null,
  "lat": 37.6846518,
  "long": 126.7695065
 },
 {
  "title": "GS25 일산충의점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1729",
  "phone": "031-975-5091",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6919074,
  "long": 126.7752075
 },
 {
  "title": "세븐일레븐 탄현미주점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1998",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68970582,
  "long": 126.7711281
 },
 {
  "title": "GS25 일산주은점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1997",
  "phone": "031-918-9841",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69113389,
  "long": 126.7716045
 },
 {
  "title": "떡사랑떡집",
  "category": "한식",
  "address": "경기도 고양시 일산서구 탄현동 132-62",
  "phone": "031-913-0089",
  "open": null,
  "close": null,
  "lat": 37.6985253,
  "long": 126.765518
 },
 {
  "title": "피자마루(탄현점)",
  "category": "양식",
  "address": "경기도 고양시 일산서구 탄현동 132-62",
  "phone": "031-915-1082",
  "open": null,
  "close": null,
  "lat": 37.6985253,
  "long": 126.765518
 },
 {
  "title": "파리바게뜨(탄현큰마을점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 탄현동 131-7",
  "phone": "031-921-0300",
  "open": null,
  "close": null,
  "lat": 37.6989289,
  "long": 126.7655215
 },
 {
  "title": "GS25 탄현큰마을점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 121",
  "phone": "031-911-5124",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70014661,
  "long": 126.7655482
 },
 {
  "title": "씨유(CU) 탄현센스빌점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1574-7",
  "phone": "031-919-3352",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.68954371,
  "long": 126.7620417
 },
 {
  "title": "GS25 탄현세진점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1574-1",
  "phone": "031-811-6700",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6905158,
  "long": 126.7627221
 },
 {
  "title": "씨유(CU) 탄현프라자점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1574-1",
  "phone": "031-914-1102",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6905158,
  "long": 126.7627221
 },
 {
  "title": "김밥천국",
  "category": "분식",
  "address": "경기도 고양시 일산서구 탄현동 1573-7",
  "phone": "031-923-8333",
  "open": null,
  "close": null,
  "lat": 37.69092953,
  "long": 126.763011
 },
 {
  "title": "한솥도시락(일산탄현점)",
  "category": "분식",
  "address": "경기도 고양시 일산서구 탄현동 1573-7",
  "phone": "031-912-5992",
  "open": null,
  "close": null,
  "lat": 37.69092953,
  "long": 126.763011
 },
 {
  "title": "롯데리아(일산탄현점)",
  "category": "패스트푸드",
  "address": "경기도 고양시 일산서구 탄현동 1563-3",
  "phone": "031-915-1928",
  "open": null,
  "close": null,
  "lat": 37.6915171,
  "long": 126.7627463
 },
 {
  "title": "신참떡볶이(일산탄현점)",
  "category": "분식",
  "address": "경기도 고양시 일산서구 탄현동 1563-3",
  "phone": "031-922-0319",
  "open": null,
  "close": null,
  "lat": 37.6915171,
  "long": 126.7627463
 },
 {
  "title": "피자스쿨",
  "category": "양식",
  "address": "경기도 고양시 일산서구 탄현동 1573-1",
  "phone": "031-912-9749",
  "open": null,
  "close": null,
  "lat": 37.69192923,
  "long": 126.7637139
 },
 {
  "title": "GS25 탄현3단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1484",
  "phone": "031-923-2259",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69500262,
  "long": 126.7651523
 },
 {
  "title": "GS25 탄현제니스점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1640",
  "phone": "031-912-0678",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69507232,
  "long": 126.7621678
 },
 {
  "title": "GS25 탄현드림점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1560-6",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6912023,
  "long": 126.7621177
 },
 {
  "title": "세븐일레븐 일산탄현예일점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1563-3",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6915171,
  "long": 126.7627463
 },
 {
  "title": "이마트24 일산탄현중심점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1563-3",
  "phone": "031-923-5655",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6915171,
  "long": 126.7627463
 },
 {
  "title": "GS25 덕이대림점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 730-3",
  "phone": "031-922-9212",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70059256,
  "long": 126.7411951
 },
 {
  "title": "GS25 일산다온점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 766-10",
  "phone": "031-911-1750",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69841483,
  "long": 126.7440465
 },
 {
  "title": "빵굽는작은마을",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 주엽동 102-2",
  "phone": "031-919-0985",
  "open": null,
  "close": null,
  "lat": 37.6683463,
  "long": 126.7633048
 },
 {
  "title": "세븐일레븐 일산동주점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 102-2",
  "phone": "031-911-9409",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6683463,
  "long": 126.7633048
 },
 {
  "title": "김밥나라",
  "category": "분식",
  "address": "경기도 고양시 일산서구 주엽동 109-1",
  "phone": "031-811-2033",
  "open": null,
  "close": null,
  "lat": 37.6697058,
  "long": 126.7602714
 },
 {
  "title": "GS25 일산주엽점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 109-1",
  "phone": "031-925-2614",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6697058,
  "long": 126.7602714
 },
 {
  "title": "칠첩반상",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 주엽동 115-2",
  "phone": "031-913-7001",
  "open": null,
  "close": null,
  "lat": 37.6705116,
  "long": 126.7585078
 },
 {
  "title": "세븐일레븐 일산주엽뉴서울프라자점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 81",
  "phone": "031-916-9954",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66712343,
  "long": 126.7654714
 },
 {
  "title": "파리바게뜨(강선마을점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 주엽동 75",
  "phone": "031-911-7870",
  "open": null,
  "close": null,
  "lat": 37.66781049,
  "long": 126.7666344
 },
 {
  "title": "GS25 주엽한사랑점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 71-2",
  "phone": "031-916-6515",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66980694,
  "long": 126.7629648
 },
 {
  "title": "씨유(CU) 주엽효원점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 110",
  "phone": "031-912-1608",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67064255,
  "long": 126.7591503
 },
 {
  "title": "정현푸드",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 주엽동 18-2",
  "phone": "031-915-0050",
  "open": null,
  "close": null,
  "lat": 37.6715085,
  "long": 126.758973
 },
 {
  "title": "세븐일레븐 주엽중앙점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 18-2",
  "phone": "031-922-3641",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6715085,
  "long": 126.758973
 },
 {
  "title": "파리바게뜨(문촌점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 주엽동 138",
  "phone": "031-911-9490",
  "open": null,
  "close": null,
  "lat": 37.67254559,
  "long": 126.7540059
 },
 {
  "title": "하림각",
  "category": "중식",
  "address": "경기도 고양시 일산서구 주엽동 138",
  "phone": "031-912-9922",
  "open": null,
  "close": null,
  "lat": 37.67254559,
  "long": 126.7540059
 },
 {
  "title": "씨유(CU) 주엽중앙로점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 138",
  "phone": "031-911-3725",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67254559,
  "long": 126.7540059
 },
 {
  "title": "롯데리아롯데마트주엽점",
  "category": "패스트푸드",
  "address": "경기도 고양시 일산서구 주엽동 15",
  "phone": "031-919-9875",
  "open": null,
  "close": null,
  "lat": 37.67365818,
  "long": 126.7546409
 },
 {
  "title": "세븐일레븐 일산롯데마트점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 15",
  "phone": "031-914-7106",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67365818,
  "long": 126.7546409
 },
 {
  "title": "세븐일레븐 일산서구청점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2199",
  "phone": "031-911-4526",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67531357,
  "long": 126.7506322
 },
 {
  "title": "씨유(CU) 대화킨텍스존점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2239",
  "phone": "031-916-7276",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67481028,
  "long": 126.749535
 },
 {
  "title": "GS25 대화트루아점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2223",
  "phone": "031-911-0011",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67521204,
  "long": 126.7486486
 },
 {
  "title": "GS25 대화다산점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2203-3",
  "phone": "031-917-2559",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.676015,
  "long": 126.7486253
 },
 {
  "title": "씨유(CU) 대화중앙로점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2203-3",
  "phone": "031-918-2121",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.676015,
  "long": 126.7486253
 },
 {
  "title": "예가찬방",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 대화동 2207",
  "phone": "031-919-9197",
  "open": null,
  "close": null,
  "lat": 37.6769173,
  "long": 126.7475604
 },
 {
  "title": "세븐일레븐 일산대화점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2222-2",
  "phone": "031-913-7940",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67553123,
  "long": 126.7479234
 },
 {
  "title": "한솥일산대화역킨텍스",
  "category": "분식",
  "address": "경기도 고양시 일산서구 대화동 2203-1",
  "phone": "031-912-0001",
  "open": null,
  "close": null,
  "lat": 37.67621309,
  "long": 126.7482761
 },
 {
  "title": "파리바게뜨(대화역점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 대화동 2222",
  "phone": "031-918-1086",
  "open": null,
  "close": null,
  "lat": 37.67573207,
  "long": 126.7474632
 },
 {
  "title": "세븐일레븐 대화중앙점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2203",
  "phone": "031-912-4231",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6763345,
  "long": 126.747908
 },
 {
  "title": "세븐일레븐 대화역점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2220-1",
  "phone": "031-924-4358",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67595093,
  "long": 126.747021
 },
 {
  "title": "세븐일레븐 일산대화역점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2220-1",
  "phone": "031-924-4358",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67595093,
  "long": 126.747021
 },
 {
  "title": "씨유(CU) 일산대화점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2205-1",
  "phone": "031-917-5236",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6765231,
  "long": 126.7474276
 },
 {
  "title": "이마트24 대화역점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2220",
  "phone": "031-912-0329",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6760102,
  "long": 126.7467323
 },
 {
  "title": "세븐일레븐 일산고양체육관점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2320",
  "phone": "070-4196-1597",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6764217,
  "long": 126.7430656
 },
 {
  "title": "수랏상찬방",
  "category": "반찬",
  "address": "경기도 고양시 일산서구 주엽동 75",
  "phone": "031-923-7292",
  "open": null,
  "close": null,
  "lat": 37.66781049,
  "long": 126.7666344
 },
 {
  "title": "뚜레쥬르(주엽역점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 주엽동 66-1",
  "phone": "031-913-2033",
  "open": null,
  "close": null,
  "lat": 37.67025895,
  "long": 126.7619286
 },
 {
  "title": "세븐일레븐 킨텍스제1전시장점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2600",
  "phone": "1577-0711",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6689351,
  "long": 126.7458026
 },
 {
  "title": "씨유(CU) 킨텍스2호점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2306",
  "phone": "031-995-8356",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6689351,
  "long": 126.7458026
 },
 {
  "title": "세븐일레븐 일산브로맥스점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2603",
  "phone": "031-911-1754",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66584298,
  "long": 126.7510974
 },
 {
  "title": "GS25 대화신우점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2283-4",
  "phone": "031-912-3714",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6704366,
  "long": 126.7515686
 },
 {
  "title": "이마트24 이마트타운2호점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2703",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66158296,
  "long": 126.7440642
 },
 {
  "title": "GS25 탄현사랑점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1500-1",
  "phone": "031-922-5419",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6943459,
  "long": 126.7706432
 },
 {
  "title": "이마트24 일산탄현점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1634",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70299021,
  "long": 126.7658393
 },
 {
  "title": "세븐일레븐 일산한뫼점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1600-9",
  "phone": "031-913-5400",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6934161,
  "long": 126.7756679
 },
 {
  "title": "GS25 탄현대림점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1593-14",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6930193,
  "long": 126.7735485
 },
 {
  "title": "GS25 덕이하이파크점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 1529",
  "phone": "080-555-2525",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69977407,
  "long": 126.7510494
 },
 {
  "title": "GS25 덕이로데오점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 398",
  "phone": "031-916-9525",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69322851,
  "long": 126.7540601
 },
 {
  "title": "GS25 덕이사랑점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 1535",
  "phone": "031-911-1766",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69744862,
  "long": 126.7523136
 },
 {
  "title": "GS25 덕이한소망점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 덕이동 338-38",
  "phone": "031-921-2441",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.70359468,
  "long": 126.7564571
 },
 {
  "title": "GS25 원마운트점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2606",
  "phone": "031-961-6418",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6645532,
  "long": 126.7545265
 },
 {
  "title": "이마트24 일산원마운트점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2606",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6645532,
  "long": 126.7545265
 },
 {
  "title": "파리바게뜨(일산탄현점)",
  "category": "제과점",
  "address": "경기도 고양시 일산서구 탄현동 1493-12",
  "phone": "031-925-7081",
  "open": null,
  "close": null,
  "lat": 37.6931402,
  "long": 126.7681221
 },
 {
  "title": "이마트24 일산탄현6단지점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1479",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69613503,
  "long": 126.7673711
 },
 {
  "title": "GS25 탄현풍림점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1585",
  "phone": "1644-5425",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6915573,
  "long": 126.768805
 },
 {
  "title": "세븐일레븐 탄현삼익점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1493-12",
  "phone": "031-911-7162",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.69392697,
  "long": 126.7679284
 },
 {
  "title": "씨유(CU) 탄현제일점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 탄현동 1490",
  "phone": "031-923-6684",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.6944441,
  "long": 126.7696041
 },
 {
  "title": "이마트24 일산강선점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 주엽동 90",
  "phone": "02-6916-1500",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66398592,
  "long": 126.7626161
 },
 {
  "title": "GS25 레이킨스점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2602",
  "phone": "031-917-0948",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66799248,
  "long": 126.7516317
 },
 {
  "title": "씨유(CU) 레이킨스몰점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2602",
  "phone": "031-978-6700",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.66799248,
  "long": 126.7516317
 },
 {
  "title": "GS25 대화행복점",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 대화동 2276",
  "phone": "031-914-1489",
  "open": "0:00",
  "close": "23:59",
  "lat": 37.67184633,
  "long": 126.7488117
 },
 {
  "title": "미소찬방",
  "category": "편의점",
  "address": "경기도 고양시 일산서구 일산동 1066",
  "phone": "031-918-5200",
  "open": null,
  "close": null,
  "lat": 37.68004861,
  "long": 126.7644422
 }
];
/*
**********************************************************
3. 여러개 마커 찍기
  * 주소 - 좌표 변환
https://apis.map.kakao.com/web/sample/multipleMarkerImage/ (여러개 마커)
https://apis.map.kakao.com/web/sample/addr2coord/ (주소로 장소 표시하기)
*/
button1 = document.getElementById("1km");
button2 = document.getElementById('3km');
button3 = document.getElementById('10km');

// 주소-좌표 변환 객체를 생성합니다
var geocoder = new kakao.maps.services.Geocoder();

// 주소-좌표 변환 함수
function getCoordsByAddress(address) {
  return new Promise((resolve, reject) => {
    // 주소로 좌표를 검색합니다
    geocoder.addressSearch(address, function (result, status) {
      // 정상적으로 검색이 완료됐으면
      if (status === kakao.maps.services.Status.OK) {
        var coords = new kakao.maps.LatLng(result[0].y, result[0].x);
        resolve(coords);
        return;
      }
      reject(new Error("getCoordsByAddress Error: not Vaild Address"));
    });
  });
}

/* 
*************************************************************
4. 마커에 인포윈도우 붙이기
  * 마커에 클릭 이벤트로 인포윈도우 https://apis.map.kakao.com/web/sample/multipleMarkerEvent/
  * url에서 섬네일 따기
  * 클릭한 마커로 지도 센터 이동 https://apis.map.kakao.com/web/sample/moveMap/
*/
function getContent(data) {
  

  // 인포윈도우 가공하기
  return `
  <div class = "wrap">
  <div class="info">
   <div class="infowindow-img-container">
        <img
          src="${data.category}.png"
          class="infowindow-img"
        />
      </div>
        <h1 class="title">${data.title}</h1>
        <div class="body">
        <a href="https://map.kakao.com/link/to/${data.title},${data.lat},${data.long}" class="infowindow-btn" target="_blank">길찾기</a>
        <h2 class="infowindow-address">${data.address}</h2>
        <h2 class="infowindow-open"> 오픈시간:${data.open},마감시간 ${data.close}</h2>
        <h2 class ="infowindow-phone">전화번호 ${data.phone}</h2>   
        </div>
    </div>
    </div>
  `;
}

async function setMap(dataSet) {
  markerArray = [];
  infowindowArray = [];

  for (var i = 0; i < dataSet.length; i++) {
    // 마커를 생성합니다
    let coords = await getCoordsByAddress(dataSet[i].address);
    var marker = new kakao.maps.Marker({
      map: map, // 마커를 표시할 지도
      position: coords, // 마커를 표시할 위치
    });
  
    markerArray.push(marker);
    markerArray.forEach(function(m) {
    var c1 = map.getCenter();
    var c2 = m.getPosition();
    var poly = new kakao.maps.Polyline({
      // map: map, 을 하지 않아도 거리는 구할 수 있다.
      path: [c1, c2]
    });
    var dist = poly.getLength(); // m 단위로 리턴
    if (dist < radius) {
        m.setMap(map);
    } else {
        m.setMap(null);
    }
});
    // 마커에 표시할 인포윈도우를 생성합니다
    var infowindow = new kakao.maps.InfoWindow({
      content: getContent(dataSet[i]),
      position: marker.getPosition() // 인포윈도우에 표시할 내용
    });

    infowindowArray.push(infowindow);

    console.log(markerArray, infowindowArray);

    // 마커에 mouseover 이벤트와 mouseout 이벤트를 등록합니다
    // 이벤트 리스너로는 클로저를 만들어 등록합니다
    // for문에서 클로저를 만들어 주지 않으면 마지막 마커에만 이벤트가 등록됩니다
    kakao.maps.event.addListener(
      marker,
      "click",
      makeOverListener(map, marker, infowindow, coords)
    );
    kakao.maps.event.addListener(map, "click", makeOutListener(infowindow));
  }
  
}

// 인포윈도우를 표시하는 클로저를 만드는 함수입니다
// 1. 클릭시 다른 인포윈도우 닫기
// 2. 클릭한 곳으로 지도 중심 옮기기
function makeOverListener(map, marker, infowindow, coords) {
  return function () {
    // 1. 클릭시 다른 인포윈도우 닫기
    closeInfoWindow();
    infowindow.open(map, marker);
    // 2. 클릭한 곳으로 지도 중심 옮기기
    map.panTo(coords);
  };
}

let infowindowArray = [];
function closeInfoWindow() {
  for (let infowindow of infowindowArray) {
    infowindow.close();
  }
}

// 인포윈도우를 닫는 클로저를 만드는 함수입니다
function makeOutListener(infowindow) {
  return function () {
    infowindow.close();
  };
}

/*
**********************************************
5. 카테고리 분류
*/

// 카테고리
const categoryMap = {
  korea: "편의점",
  china: "중식",
  japan: "제과점",
  america: "한식",
  wheat: "반찬",
  meat: "패스트푸드",
  sushi: "양식",
  etc: "분식",
};

const categoryList = document.querySelector(".category-list");
categoryList.addEventListener("click", categoryHandler);

function categoryHandler(event) {
  const categoryId = event.target.id;
  const category = categoryMap[categoryId];

  // 데이터 분류
  let categorizedDataSet = [];
  for (let data of dataSet) {
    if (data.category === category) {
      categorizedDataSet.push(data);
    }
  }

  // 기존 마커 삭제
  closeMarker();

  // 기존 인포윈도우 닫기
  closeInfoWindow();

  setMap(categorizedDataSet);
}

let markerArray = [];
function closeMarker() {
  for (marker of markerArray) {
    marker.setMap(null);
  }
}


// 일정 거리 내의 가맹점을 보여주자
const lengthList = document.querySelector(".length-list");
lengthList.addEventListener("click", lengthHandler);
function lengthHandler(event){
  const lengthId = event.target.id;
  closeMarker();
  closeInfoWindow();
  radius = lengthId;
  setMap(dataSet);
  var s = document.getElementById("length-info");
  s.innerHTML=radius/1000+"km이내의 가맹점을 조회합니다.";
}


setMap(dataSet);









